{"username": 1641276050377146369, "original_tweet": "@LockSmith15270 The Home run King's, Babe Ruth, Hank Aaron\nWho was the last one, sometimes I have to look him up\nI think LeBron James will be Remembered like what's his name again Oh' Barry Bonds\nThe best part, is not that LeBron James is being hated, but LeBron James being:\n\nF O R G O T T E N", "cleaned_tweet": "home run kings babe ruth hank aaron last one sometimes look think lebron james remembered like whats name oh barry bonds best part lebron james hated lebron james"}
{"username": 47793230, "original_tweet": "LeBron thought he will be a goat, but he should to everyone he is an ass. https://t.co/jljoCwCRaB", "cleaned_tweet": "lebron thought goat everyone ass"}
{"username": 1390913564, "original_tweet": "@amuse How? How can you be a legit basketball fan, watch this, and say LeBron is the best ever? I really want to know. Because if you watch this and say THAT is the greatest of all time, you need to donate your brain to science.", "cleaned_tweet": "legit basketball fan watch say lebron best ever really want know watch say greatest time need donate brain science"}
{"username": 1064280237033299969, "original_tweet": "@4ktNba @kanye_breasts @IssaShaikheldin @BleacherReport @NBCSAuthentic LeBron has never won a championship and not been the best player on the team/court \n\nBoth Kobe and Steph did that multiple times😭😭", "cleaned_tweet": "lebron never championship best player teamcourt kobe steph multiple times"}
{"username": 1460829114911313925, "original_tweet": "@ricky_g_157 @TheBBallSage Uhhh no. Curry is solidified. Anything he wins or loses now, it’s all additions. After a decade plus, I’m not gonna bag on a 37 year old too much. Same way I won’t after Lebron is 2-12 or 2-14 in his playoff games in recent years. He’s still the GOAT to people.  It is what it is", "cleaned_tweet": "uhhh curry solidified anything wins loses additions decade plus im gon na bag year old much way wont lebron playoff games recent years hes still goat people"}
{"username": 45334340, "original_tweet": "@OILMAN24x7 @Dom_L_ @fasc1nate @DjokerNole Lebron James also outplays Michael Jordan on stats. Ali does not have the best stats in boxing. You can find endless examples. Secondly, H2H is not the best metrics. Djokovic has a loosing H2H against Andy Roddick, but is still a better player. \nMany more examples.", "cleaned_tweet": "lebron james also outplays michael jordan stats ali best stats boxing find endless examples secondly hh best metrics djokovic loosing hh andy roddick still better player many examples"}
{"username": 1807675095323643904, "original_tweet": "@cherubnuts @LakeShowYo Wow ur a dirty hater.😂😂reposting some photos that don't mean shit😂record vs West teams like it means the East is weak and not that LeBron has been 36 already in 2021😂65 pts, 25 rebs, 15 ast, 10 stocks in games 3 &amp; 4, looking like a DPOY at age 40. Ur GOAT probably Kobe😂😂😭", "cleaned_tweet": "wow ur dirty haterreposting photos dont mean shitrecord vs west teams like means east weak lebron already pts rebs ast stocks games amp looking like dpoy age ur goat probably kobe"}
{"username": 881401691509227520, "original_tweet": "@BleacherReport @mcten LeBron is too soft to be a goat. \n\n#1 MJ\n#2 Kobe\n#3 LeBron https://t.co/kYyT4aM1Xg", "cleaned_tweet": "lebron soft goat mj kobe lebron"}
{"username": 1853940260016717824, "original_tweet": "@batta_zach @HoodiiBron @BronOverBumJ I'm sorry but that's just not the case at all and you know it Lebron has been absolutely scrutinised and ridiculed since we've left the playoffs despite being 40 fucking years old and our best player during our playoff campagin. Nice try tho lmfao.", "cleaned_tweet": "im sorry thats case know lebron absolutely scrutinised ridiculed since weve left playoffs despite fucking years old best player playoff campagin nice try tho lmfao"}
{"username": 18860022, "original_tweet": "Jordan never had to nickname himself. We all knew he was the GOAT 🔥 https://t.co/pSi5cCIZzC", "cleaned_tweet": "jordan never nickname knew goat"}
{"username": 1445001124621209600, "original_tweet": "@TheRealMattSage @BronGotGame LeBron is 40 my guy and no longer the best player on his team Curry is blowing a 3-1 lead again to Jalen Green while being the best player on his team it’s definitely legacy changing.", "cleaned_tweet": "lebron guy longer best player team curry blowing lead jalen green best player team definitely legacy changing"}
{"username": 1551268792059285506, "original_tweet": "@HoopMixOnly 100%, They hate to see bulls having “3” of the all time best “teams” in history, it wasn’t Jordan, the last second 12 ft jump shots were way over rated", "cleaned_tweet": "hate see bulls time best teams history wasnt jordan last second ft jump shots way rated"}
{"username": 1403539404543643648, "original_tweet": "@IamDuder @NYSoleCollector @shendy456 And still has  accomplishments than LeBron . LeBron still chasing the goat at 40 .. you can riding his 100k points in his 100 seasons 🤣🤣🤣", "cleaned_tweet": "still accomplishments lebron lebron still chasing goat riding points seasons"}
{"username": 973022485334712325, "original_tweet": "@6ixImmortal You got fools running around here calling lebron the goat with 6 finals losses. What's the difference...", "cleaned_tweet": "got fools running around calling lebron goat finals losses whats difference"}
{"username": 136957725, "original_tweet": "@Jim_Jordan This past few months I must say has been the best I've had for a while now.I've heard of crypto &amp; #BTC but was too scared to get involved until I met @Abreu__fx who helped me understand the pros and cons of cryptotrading which I've added massively too my holder. She's great", "cleaned_tweet": "past months must say best ive nowive heard crypto amp scared get involved met helped understand pros cons cryptotrading ive added massively holder shes great"}
{"username": 1723477592718671872, "original_tweet": "@strifeomg Michael Jordan will forever be the GOAT, and it's not even close !!!!", "cleaned_tweet": "michael jordan forever goat even close"}
{"username": 1740285153866559488, "original_tweet": "@JassPreet96 Many consider Michael Jordan as the ultimate GOAT.", "cleaned_tweet": "many consider michael jordan ultimate goat"}
{"username": 3134326037, "original_tweet": "@HaterReport_ The post-Jordan NBA has become pre-Jordan NBA...irrelevant! Now tell me again who the best to ever play the game is?", "cleaned_tweet": "postjordan nba become prejordan nbairrelevant tell best ever play game"}
{"username": 1109220468, "original_tweet": "@wrldoftatum The best comp I can make to this is that any like putting Kyrie ahead of LeBron when LeBron was in Cleveland. At Celtics fans, we love JT and JB equally, but I feel like it's disingenuous by ESPN to put JB over JT because it seems like they're trying to go back to trying to split", "cleaned_tweet": "best comp make like putting kyrie ahead lebron lebron cleveland celtics fans love jt jb equally feel like disingenuous espn put jb jt seems like theyre trying go back trying split"}
{"username": 1560087528, "original_tweet": "@SportsCenter LeBron longevity excuse to the goat debate is only useful since 2019? 😅\n\nAight 🖕", "cleaned_tweet": "lebron longevity excuse goat debate useful since aight"}
{"username": 1710985661589962752, "original_tweet": "Steph Curry in 4th qtrs of games 4,5 and 6\n\n2/11 FG 18%\n2/9 3PT 22%\n\nWarriors fans ignores this and never holds him to the same standard as LeBron but I am supposed to believe that Curry is in the goat convo too https://t.co/tp3tee6qdc", "cleaned_tweet": "steph curry th qtrs games fg pt warriors fans ignores never holds standard lebron supposed believe curry goat convo"}
{"username": 1911611524059222016, "original_tweet": "Lebron been ballin since I was in high school, my kid about to be in middle school... I'll cut him some slack for the last few years. He still the Goat imo. https://t.co/zZmEp9zRAU", "cleaned_tweet": "lebron ballin since high school kid middle school ill cut slack last years still goat imo"}
{"username": 1445001124621209600, "original_tweet": "@Tutu08677792490 @LakeShowYo Lebron is also no longer the best player on his team anymore Curry is stop being an idiot my boy", "cleaned_tweet": "lebron also longer best player team anymore curry stop idiot boy"}
{"username": 936480111746015232, "original_tweet": "Lebron would have never touched goat convos if you didnt tell a fairy story about his career https://t.co/US9mC91VyA", "cleaned_tweet": "lebron would never touched goat convos didnt tell fairy story career"}
{"username": 1389937482159083523, "original_tweet": "@BleacherReport @mcten I don't think there is a REAL NBA basketball fan who didn't know LeBron would fake an injury after Ant and @timberwolves kicked his ass in the worst way possible and made fraud LeBron look like the worst fake ass goat in sports history. https://t.co/ESBxVCkkkg", "cleaned_tweet": "dont think real nba basketball fan didnt know lebron would fake injury ant kicked ass worst way possible made fraud lebron look like worst fake ass goat sports history"}
{"username": 1450966186880028678, "original_tweet": "A Curry lead team potentially blowing a 3-1 lead twice is just crazy. The goat PG and better than LeBron my ass", "cleaned_tweet": "curry lead team potentially blowing lead twice crazy goat pg better lebron ass"}
{"username": 1217199672210661376, "original_tweet": "@muss_j10 Le4-6 still trynna ring chase Michael Goat Jordan in year 26, has he no shame?", "cleaned_tweet": "le still trynna ring chase michael goat jordan year shame"}
{"username": 1298889262260158464, "original_tweet": "@the_dirtturd @tomhappel @strifeomg are you blind jordan was hitting his best Micheal Jackson impression b4 he even got to touch him", "cleaned_tweet": "blind jordan hitting best micheal jackson impression even got touch"}
{"username": 1682067667505537024, "original_tweet": "@SmartPsychopat1 @MarzTalksSports @bluelemxnade Ronaldo is the LeBron of longevity for sure but if you don’t think messi is the best playmaker of all time you don’t know ball", "cleaned_tweet": "ronaldo lebron longevity sure dont think messi best playmaker time dont know ball"}
{"username": 186185539, "original_tweet": "- I’ve never  seen  the “ lebron james da crowd “ wearing his shoes..\nI have seen them argue that he the goat in Jordan’s 👀☕️ https://t.co/SzfPiJI9A8", "cleaned_tweet": "ive never seen lebron james da crowd wearing shoes seen argue goat jordans"}
{"username": 20139563, "original_tweet": "@MotoPsyOps101 Hi Jordan🙂 I appreciate it's important to get the best from your package in terms of value and any changes or increases to costs is never great, this is something you're able to have a chat around and any concerns you have. Feel free to send us over a PM and we can get you the", "cleaned_tweet": "hi jordan appreciate important get best package terms value changes increases costs never great something youre able chat around concerns feel free send us pm get"}
{"username": 1052285997369589760, "original_tweet": "@joelvmoran So why is LeBron in the conversation with MJ as the GOAT", "cleaned_tweet": "lebron conversation mj goat"}
{"username": 2865564173, "original_tweet": "@EAGLESTRIKEZ @ThatArsenalGuyy @17 They just never had the best dietitian to help them well.  People said the same thing about LeBron James.", "cleaned_tweet": "never best dietitian help well people said thing lebron james"}
{"username": 48427892, "original_tweet": "@GabrielRee41841 @BallsackSports What did LeBron do? idk maybe be the best defender on the court for both teams. He wasn't good offensively but during that the 4th quarters and crunch time he led both teams in blocks, steals, rebounds, contests and had led his team in assists. Casuals like u only know about pts.", "cleaned_tweet": "lebron idk maybe best defender court teams wasnt good offensively th quarters crunch time led teams blocks steals rebounds contests led team assists casuals like know pts"}
{"username": 707626815091826688, "original_tweet": "@shendy456 Lebron might be the third or fourth best don’t have his flopping ass top 3", "cleaned_tweet": "lebron might third fourth best dont flopping ass top"}
{"username": 426756406, "original_tweet": "@PabloYone @RichStapless As far as the KD thing goes. Steph was the more impactful player. In the 4 games they won, Steph was the best/most impactful player in 3 of them. Sure LeBron dominated the raptors to a comical degree but in 16 and 17, it was expected. Not even raptors fans thought they had a shot", "cleaned_tweet": "far kd thing goes steph impactful player games steph bestmost impactful player sure lebron dominated raptors comical degree expected even raptors fans thought shot"}
{"username": 1637564476642689024, "original_tweet": "@MaskedInLA I mean yeah that's how it goes , agendas agenda , I think LeBron's the Goat but he has lost so so much more than MJ and achieved far less   in even more time , you use whatever helps your agenda that's basketball discourse", "cleaned_tweet": "mean yeah thats goes agendas agenda think lebrons goat lost much mj achieved far less even time use whatever helps agenda thats basketball discourse"}
{"username": 45818170, "original_tweet": "We would like to wish our match officials best of luck today in the Saturday Trophy 🏆\n\nWombwell Town FC Reserves V Grange Moor Saints AFC \n\nReferee: Trevor Beck\nAssistant Referee: Theo Pawson\nAssistant Referee: Jordan Arno\nFourth Official: Ben Nutall\n\n#SHCFACountyCups https://t.co/nNoywNhR2P", "cleaned_tweet": "would like wish match officials best luck today saturday trophy wombwell town fc reserves grange moor saints afc referee trevor beck assistant referee theo pawson assistant referee jordan arno fourth official ben nutall"}
{"username": 707626815091826688, "original_tweet": "@MoodOfCulturisk @awfulannouncing Lebron is a flopper wannabe like the goat Jordan no one comes close to MJ BLACK JESUS QUEEN JAMES IS A FLOPPER", "cleaned_tweet": "lebron flopper wannabe like goat jordan one comes close mj black jesus queen james flopper"}
{"username": 335796138, "original_tweet": "I've been watching videos of Jordan Klepper at Trump rally's for the past hour or so and it's some of the best stuff I've seen. Fucking hilarious.", "cleaned_tweet": "ive watching videos jordan klepper trump rallys past hour best stuff ive seen fucking hilarious"}
{"username": 1260378837243715584, "original_tweet": "@shendy456 If you’re the GOAT, you will be the difference in a close game. LeBron isn’t even near that. He is atrocious in end games", "cleaned_tweet": "youre goat difference close game lebron isnt even near atrocious end games"}
{"username": 1807203118482141184, "original_tweet": "Lebron sacrificed memory for the moment to play with his son. Respectable. But its time to hang em up\n\nHe is the goat so it seems like he is still good but he is not anywhere near his prime. It just looks bad cause we all saw what he did. He needs to retire word to Akainu", "cleaned_tweet": "lebron sacrificed memory moment play son respectable time hang em goat seems like still good anywhere near prime looks bad cause saw needs retire word akainu"}
{"username": 262785021, "original_tweet": "@BarryOnHere At no point in LeBron’s career has anyone considered him as a unanimous GOAT. His entire career has been “if he does this, then ____.” He can be top 5 but not better than MJ.", "cleaned_tweet": "point lebrons career anyone considered unanimous goat entire career top better mj"}
{"username": 3095125401, "original_tweet": "@longcwse @jordan_rzq @NightRunners_jp but it looks the best", "cleaned_tweet": "looks best"}
{"username": 56880767, "original_tweet": "@mcten LMFAOOOOOOO how does Lebron get injured every time he gets eliminated. Lebron high key one of the biggest bitches across all sports that’s considered a goat.", "cleaned_tweet": "lmfaooooooo lebron get injured every time gets eliminated lebron high key one biggest bitches across sports thats considered goat"}
{"username": 1839677523787141120, "original_tweet": "@kyg_best gaza and west bank belong to egypt and jordan before 1967\nnot a palestine", "cleaned_tweet": "gaza west bank belong egypt jordan palestine"}
{"username": 1643854395824562176, "original_tweet": "@mikebd21 @Thetruth8240 The debate was over when LeBron came back down 3-1 to the best stacked team of all time. it was when we broke kareem record. it was over when he won the bubble ring. your right. it BEEN over.", "cleaned_tweet": "debate lebron came back best stacked team time broke kareem record bubble ring right"}
{"username": 1858634024379408385, "original_tweet": "LeBron is The Thee GOAT", "cleaned_tweet": "lebron thee goat"}
{"username": 104970359, "original_tweet": "@Goatman23_ Its funny Lebron's whole identity and legacy is about beating Jordan and he cant do it. All he can do is keep playing to stat pad and then claim look at my stats they are better! But at this point he wont pass Jordan in championships and he will never 3 peat. He isnt the Goat he", "cleaned_tweet": "funny lebrons whole identity legacy beating jordan cant keep playing stat pad claim look stats better point wont pass jordan championships never peat isnt goat"}
{"username": 504518786, "original_tweet": "@TuffAzzHooper @HaterReport_ Mj 6 rings in a 10 yrs span vs lebron 4 rings in 20 how is he the goat Jordan got less rings in less time much less time it's not even close this mj debate is done lebron is nice but not him sorry goats dont get bounce in 🖐🏾 in the first round after you start winning chips", "cleaned_tweet": "mj rings yrs span vs lebron rings goat jordan got less rings less time much less time even close mj debate done lebron nice sorry goats dont get bounce first round start winning chips"}
{"username": 1790608945083543552, "original_tweet": "@jercinema Best of luck for your endeavor toward this creation, Jordan! Really eager to learn more about the logline of \"Traitor\". Can you please share it with me? Also, hoping if you could please give us a follow-back. Thank you.", "cleaned_tweet": "best luck endeavor toward creation jordan really eager learn logline traitor please share also hoping could please give us followback thank"}
{"username": 1451523628248535040, "original_tweet": "@EasyCantMiss @HoodiiBron you’re admitting jordan’s the goat its worse to lose in the finals than first round see how dumb that sound 😂😂😂😂", "cleaned_tweet": "youre admitting jordans goat worse lose finals first round see dumb sound"}
{"username": 1452304665916346379, "original_tweet": "@chess24com What a great sport! Wishing all the best to Jordan", "cleaned_tweet": "great sport wishing best jordan"}
{"username": 1451523628248535040, "original_tweet": "@shortestngga @waddlebottle_ @30GotNext you’re admitting jordan’s the goat its worse to lose in the finals than first round see how dumb that sound 😂😂😂😂", "cleaned_tweet": "youre admitting jordans goat worse lose finals first round see dumb sound"}
{"username": 504518786, "original_tweet": "@ggbrown100 @dylanlieck @HaterReport_ Ya he does cause why else does he get mad when people say mj is the goat &amp; not him because he cares what we think which is why he made up this lie about his knee \nMj six rings in less then 10 yrs \nLebron only four rings in 20 yrs debate over", "cleaned_tweet": "ya cause else get mad people say mj goat amp cares think made lie knee mj six rings less yrs lebron four rings yrs debate"}
{"username": 756596870667837440, "original_tweet": "6) Anthony Joshua (Well, who else?)\n7) Michael B Jordan (Creed, Eric Killmonger)\n8) Joe Hendry (Because I'll most likely say his name)\n9) Lionel Messi (Let's settle this GOAT debate)\n10) Ronaldo (The real GOAT)\n11) Tunde Onakoya (Strategy)\n12) Yusuf Dikeç (Turkish Deadshot)", "cleaned_tweet": "anthony joshua well else michael jordan creed eric killmonger joe hendry ill likely say name lionel messi lets settle goat debate ronaldo real goat tunde onakoya strategy yusuf dike turkish deadshot"}
{"username": 1600246749049806889, "original_tweet": "@Goatman23_ @RJMorse13 He’s still at least a top 15 player in the league at 40. Hardly a “bum”.  I get that this is a Lebron hate/Jordan is the GOAT account. So, you’re gonna troll. But at least make it make some sense.", "cleaned_tweet": "hes still least top player league hardly bum get lebron hatejordan goat account youre gon na troll least make make sense"}
{"username": 315183340, "original_tweet": "@HoopMixOnly Jordan is the GOAT", "cleaned_tweet": "jordan goat"}
{"username": 1451523628248535040, "original_tweet": "@IronmanIcon @SwipaCam you’re admitting jordan’s the goat its worse to lose in the finals than first round see how dumb that sound 😂😂😂😂", "cleaned_tweet": "youre admitting jordans goat worse lose finals first round see dumb sound"}
{"username": 1451523628248535040, "original_tweet": "@JalenHives @SwipaCam you’re admitting jordan’s the goat its worse to lose in the finals than first round see how dumb that sound 😂😂😂😂", "cleaned_tweet": "youre admitting jordans goat worse lose finals first round see dumb sound"}
{"username": 1917493442902396928, "original_tweet": "🔥 HOTTEST!! This is novelty - the BIGGЕST #Сryрtо #РUMР #Signаl is here! 🚀 Jоin the actiоn!\n\nWelcome https://t.co/G2pmDTtNrp\n$ETH\n\nxtcNbsPk @KidLoveCode @MalothuVar43461 @universe0294 @AhmedAh92377441 @jordan_big_goat @Destinhotitular", "cleaned_tweet": "hottest novelty biggst jin actin welcome eth xtcnbspk"}
{"username": 1864572775559507968, "original_tweet": "@NotDariennn michael \"rapist is my best friend\" b jordan wasnt that good lol not even top 5 movie this year", "cleaned_tweet": "michael rapist best friend jordan wasnt good lol even top movie year"}
{"username": 1451523628248535040, "original_tweet": "@DHadziefendic @OnBallSkip @SwipaCam you’re admitting jordan’s the goat its worse to lose in the finals than first round see how dumb that sound 😂😂😂😂", "cleaned_tweet": "youre admitting jordans goat worse lose finals first round see dumb sound"}
{"username": 1451523628248535040, "original_tweet": "@Hassan0210318 @OnBallSkip @SwipaCam yes bro yall are literally using that logic 😂you’re admitting jordan’s the goat its worse to lose in the finals than first round see how dumb that sound 😂😂😂😂", "cleaned_tweet": "yes bro yall literally using logic youre admitting jordans goat worse lose finals first round see dumb sound"}
{"username": 1451523628248535040, "original_tweet": "everyone who believes this must think jordan is the goat because that means losing first round is better than losing in the finals 😂 https://t.co/HTwD16XdJL", "cleaned_tweet": "everyone believes must think jordan goat means losing first round better losing finals"}
{"username": 1284971198732886016, "original_tweet": "@216SuperBrowns Curry was injured… simple\n\nLeBron has had @ LEAST 1 other top 10 player in 9 of his 10 finals attempts\n\nif he’s the GOAT and has another top 10 guy on a team with a strong supporting cast….. he should EASILY have a winning record in the finals….\n\nDude is sham \n\n#LeMptyStats", "cleaned_tweet": "curry injured simple lebron least top player finals attempts hes goat another top guy team strong supporting cast easily winning record finals dude sham"}
{"username": 1298482942046478336, "original_tweet": "@Shane00 kobe's  best teammates  in those 7 yrears\n10-12 pau\n13-howard 1 year\n14-nick young  kobe (6 games)\n15-nick young    kobe (35 games)\n16-  clarkson\nlebron's best teammates\nIngram 1 year\nAD\nLuka\nand in 22 they had 5 total top 75 players\n4 of those 5 were the  were top 5 in scoring", "cleaned_tweet": "kobes best teammates yrears pau howard year nick young kobe games nick young kobe games clarkson lebrons best teammates ingram year ad luka total top players top scoring"}
{"username": 1747059449527738368, "original_tweet": "@VcwAb26077 @Trevor_Lane Out of him Luka and Reaves Lebron was the best defender in the wolves series by a mile. Like as in having any other take would be impossible to argue.", "cleaned_tweet": "luka reaves lebron best defender wolves series mile like take would impossible argue"}
{"username": 1710727218626695168, "original_tweet": "@Wizelycook LeBron with 4 rings and 4 FMVPs is the most in the best era with the most FMVPs, still could get more", "cleaned_tweet": "lebron rings fmvps best era fmvps still could get"}
{"username": 1469959594373910530, "original_tweet": "@JassPreet96 ✍️figures like Michael Jordan or Serena Williams are often labeled as the GOAT", "cleaned_tweet": "figures like michael jordan serena williams often labeled goat"}
{"username": 1265644253193084929, "original_tweet": "@PhilosoSwerve Have you actually watched the games? Cause LeBron was the best player on both the offensive and defensive side. His +/- may look bad but that’s cause he’s been averaging 40 min a game. +/- is a very flawed stat to judge players with high minutes", "cleaned_tweet": "actually watched games cause lebron best player offensive defensive side may look bad thats cause hes averaging min game flawed stat judge players high minutes"}
{"username": 1265644253193084929, "original_tweet": "@tonyzampana Have you actually watched the games? Cause LeBron was the best player on both the offensive and defensive side. His +/- may look bad but that’s cause he’s been averaging 40 min a game. +/- is a very flawed stat to judge players with high minutes", "cleaned_tweet": "actually watched games cause lebron best player offensive defensive side may look bad thats cause hes averaging min game flawed stat judge players high minutes"}
{"username": 1265644253193084929, "original_tweet": "@rlyoutheway +/- is a meaningless stats for players who play high minutes. LeBron was without a doubt the best player in both offensive and defensive side. They’re using a very flawed stat to push an agenda against bron", "cleaned_tweet": "meaningless stats players play high minutes lebron without doubt best player offensive defensive side theyre using flawed stat push agenda bron"}
{"username": 1599449431, "original_tweet": "@AffluentYoungDr @betaflash49 @LakeShowYo @BleacherReport “You dont seem very bright! Along w/2top 10 players &amp; a 3rd that LAL fans swore was better than 90% of other teams 2nd best player &amp; all 3rd bests, w/veteran 3nD &amp; others LAL fans swore were better than everyone, LEBRON NEEDS MORE WHILE ALSO ABSOLUTELY MAXING OUT ALL MONEY”", "cleaned_tweet": "dont seem bright along wtop players amp rd lal fans swore better teams nd best player amp rd bests wveteran nd amp others lal fans swore better everyone lebron needs also absolutely maxing money"}
{"username": 1565693044581703681, "original_tweet": "@Goatman23_ YOU SO RIGHT ABOUT EVERYTHING U  SAID ABOUT JORDAN BECAUSE  I SEEN JORDAN PLAY IN COLLEGE AND THE NBA. JORDAN IS A DIFFERENT BREED AND THAT'S WHY HE THE GOAT OF THE NBA. LEBRON SHOULD'VE  NEVER BEEN COMPARED TO JORDAN AS BEING THE GOAT. JORDAN WILL FOREVER THE GOAT OF THE NBA🐐🐐", "cleaned_tweet": "right everything said jordan seen jordan play college nba jordan different breed thats goat nba lebron shouldve never compared jordan goat jordan forever goat nba"}
{"username": 1742608295355949056, "original_tweet": "MLB Best K% Matchups for May 3nd 🏟️⚾️\n\nMax Meyer 5.5 Strikeouts\nJordan Hicks 5.5 Strikeouts \nNick Lodolo 5.5 Strikeouts \nJack Flaherty 6.5 Strikeouts \n\nhttps://t.co/IKinrXIstO\n\n#Prizepicks #GamblingTwitter #GamblingX https://t.co/E054lbzR6y", "cleaned_tweet": "mlb best matchups may nd max meyer strikeouts jordan hicks strikeouts nick lodolo strikeouts jack flaherty strikeouts"}
{"username": 1623885365261094915, "original_tweet": "MLB Best K% Matchups for May 3nd 🏟️⚾️\n\nMax Meyer 5.5 Strikeouts\nJordan Hicks 5.5 Strikeouts \nNick Lodolo 5.5 Strikeouts \nJack Flaherty 6.5 Strikeouts \n\n@propsdotcash for the research\n\n#Prizepicks #GamblingTwitter #GamblingX https://t.co/oHk2F9Nxbn", "cleaned_tweet": "mlb best matchups may nd max meyer strikeouts jordan hicks strikeouts nick lodolo strikeouts jack flaherty strikeouts research"}
{"username": 1512153611475816451, "original_tweet": "@kyg_best There isn’t one. Palestine doesn’t exist unless you count Jordan, in which case it’s Amman.", "cleaned_tweet": "isnt one palestine doesnt exist unless count jordan case amman"}
{"username": 481600084, "original_tweet": "@NoLimitsRiq i like bron and think he could be goat. but these “oh lebron actually was injured” stories that come out after a loss are ridiculous. like after 2018 finals and suddenly “his hand may be broken”", "cleaned_tweet": "like bron think could goat oh lebron actually injured stories come loss ridiculous like finals suddenly hand may broken"}
{"username": 1334399974923112449, "original_tweet": "@Dittloff4Senate All the best Jordan. 🙂 \n#Votelibertarian #Vote1\n#Libertarians\n@LibertariansAus \n@LibertariansVic @LibertariansQLD @LibertariansNSW @LibertariansWAU  @LibertariansSA", "cleaned_tweet": "best jordan"}
{"username": 305575017, "original_tweet": "Which of these versions of LeBron James was the best in your opinion? \n- Miami Heat LeBron \n- Cleveland Cavs LeBron", "cleaned_tweet": "versions lebron james best opinion miami heat lebron cleveland cavs lebron"}
{"username": 1809775514292482048, "original_tweet": "@JassPreet96 figures like Michael Jordan or Serena Williams are often labeled as the GOAT", "cleaned_tweet": "figures like michael jordan serena williams often labeled goat"}
{"username": 1182306882309914624, "original_tweet": "@mcten A collision LeBron initiated and flopped with.\n😂\n\nGOAT", "cleaned_tweet": "collision lebron initiated flopped goat"}
{"username": 1277234962995937281, "original_tweet": "@bowtiedstocks This is covered in Jordan Petersons latest foray with Ro Jogan. Parasitic empathy if something like that. It works do politicians well to talk to the likes of Peterson on the best way to combat this talk that the unwary youth fall into... the old ones too.", "cleaned_tweet": "covered jordan petersons latest foray ro jogan parasitic empathy something like works politicians well talk likes peterson best way combat talk unwary youth fall old ones"}
{"username": 192596092, "original_tweet": "I’m happy yall starting to hold this nigga accountable. Let it be LeBron and every loss is his fault. Keep that same energy with Steph. He a goat right? https://t.co/RlUGgEU9xY", "cleaned_tweet": "im happy yall starting hold nigga accountable let lebron every loss fault keep energy steph goat right"}
{"username": 1539928091950075904, "original_tweet": "@YeahYepYesYo @Dittloff4Senate Even some of us sheep think Jordan is a good guy who wants what's best for his community....no bull!", "cleaned_tweet": "even us sheep think jordan good guy wants whats best communityno bull"}
{"username": 882883679537823744, "original_tweet": "@HoopMixOnly All that being said: \nLebrons finals record 4-6\nJordan’s finals record 6-0 \n\nWho is still playing into their 22nd yr? \nWho played 13 seasons? \nWho is the GOAT?", "cleaned_tweet": "said lebrons finals record jordans finals record still playing nd yr played seasons goat"}
{"username": 741124905194901504, "original_tweet": "@BleacherReport @mcten Yeah he got hurt while he was flopping Mr flopping King of the NBA what a joke people want to call him the goat let me tell you something a goat don't have flopping in his resume and it's all that man wants to do is flop he doesn't make a pimple on Michael Jordan's butt", "cleaned_tweet": "yeah got hurt flopping mr flopping king nba joke people want call goat let tell something goat dont flopping resume man wants flop doesnt make pimple michael jordans butt"}
{"username": 1429470086, "original_tweet": "@SwipaCam They going move the goal post lol curry about lose in the first round just like LeBron . Stop that goat talk . Can’t even beat the rockets 😂😂", "cleaned_tweet": "going move goal post lol curry lose first round like lebron stop goat talk cant even beat rockets"}
{"username": 1527515568642805760, "original_tweet": "@IanWesley9 @BrownstoneSteve @Super70sSports Yeah so Jordan failed 9 times, and couldn’t even get to .500 a single time without Scottie. That’s why Russell is the goat", "cleaned_tweet": "yeah jordan failed times couldnt even get single time without scottie thats russell goat"}
{"username": 1284971198732886016, "original_tweet": "@jaredsla @LBJsBest Not a Jordan fan… But he’s the GOAT\n\nMost Finals losses, most playoff losses, and most series losse\n\n4-6 in the finals (9 attempts were with @ LEAST  1 other top 10 player) \n\nVanishes on the Biggest Stage when he’s needed most \n\nNot even  a Top 5 all-time player\n\n#LeMptyStats https://t.co/2aRn8akC7X", "cleaned_tweet": "jordan fan hes goat finals losses playoff losses series losse finals attempts least top player vanishes biggest stage hes needed even top alltime player"}
{"username": 1446817650827411456, "original_tweet": "@LeBron__legacy When did he become the goat PG? https://t.co/LsVc4Aj04u", "cleaned_tweet": "become goat pg"}
{"username": 748071545877082112, "original_tweet": "@Multiple_MVP @Lakersided310 @Trevor_Lane From impact metris Lebron isn't a top 10 player, he can be the best player on the night on a given night still but there has been drop in his impact. He is the 15-20, even the 25 range. He is human... You still pay him though because of his brand and eat the impact drop.", "cleaned_tweet": "impact metris lebron isnt top player best player night given night still drop impact even range human still pay though brand eat impact drop"}
{"username": 1632104682838474753, "original_tweet": "LeBron has the best teammate out of them all and yet he sucks https://t.co/WE19g50rKB", "cleaned_tweet": "lebron best teammate yet sucks"}
{"username": 1893733223974555648, "original_tweet": "@thadgicjohnson @BarryOnHere Or maybe the team was better as it’s based on the team not the just the best player. Also the competition for lebron was better", "cleaned_tweet": "maybe team better based team best player also competition lebron better"}
{"username": 1604446793244237824, "original_tweet": "@Lebronin1 @LakeShowYo i don’t wanna hear shit about lebron being the goat cuz his ass caught 3 straight first round exists with one of those series being a sweep", "cleaned_tweet": "dont wan na hear shit lebron goat cuz ass caught straight first round exists one series sweep"}
{"username": 2414114863, "original_tweet": "The food van is open with father and son team Richard and Jordan serving the best bacon rolls in #Chiswick https://t.co/NGqzs4AVbH", "cleaned_tweet": "food van open father son team richard jordan serving best bacon rolls"}
{"username": 1691290823466332162, "original_tweet": "Jordan Travis retires after an inspiring journey with FSU. Thank you for your leadership and unforgettable moments on the field!    https://t.co/gjya6z2OMP https://t.co/cG2ZarfsNc", "cleaned_tweet": "jordan travis retires inspiring journey fsu thank leadership unforgettable moments field"}
{"username": 1451379045384347650, "original_tweet": "If you think LeBron is the GOAT then so is Brady.\n\nI accept one wholeheartedly and one begrudgingly.", "cleaned_tweet": "think lebron goat brady accept one wholeheartedly one begrudgingly"}
{"username": 1197503256, "original_tweet": "@rlbaber22 @Jagoffz @MarkAGunnels LeBron would murder Jordan…. GOAT is up for debate, best ever is not an argument. Gotta let your childhood go my man. You’re a grown up", "cleaned_tweet": "lebron would murder jordan goat debate best ever argument got ta let childhood go man youre grown"}
{"username": 1893864254018924544, "original_tweet": "As people get older, die, lose interest, priorities. The popularity of the older generations goats diminishes… 20, 30 years from now Mj won’t be the topic, Kobe won’t, LeBron MIGHT be battling the modern day “goat” 🏀 4:7", "cleaned_tweet": "people get older die lose interest priorities popularity older generations goats diminishes years mj wont topic kobe wont lebron might battling modern day goat"}
{"username": 1893864254018924544, "original_tweet": "Mj was the goat, Kobe was the goat, LeBron currently holds the title, there will be another that will hold that mantle. Can we not just agree that outside of accolades, the changes, growth and popularity of the game stems from people growing up idolising these players… 🏀 2:7", "cleaned_tweet": "mj goat kobe goat lebron currently holds title another hold mantle agree outside accolades changes growth popularity game stems people growing idolising players"}
{"username": 1893864254018924544, "original_tweet": "Kobe is my GOAT, but I will say that I know that Mj and LeBron are just as deserving.  I just want to say that this is always going to be a debate amongst basketball fans. Why can it not be categorised. The game has changed so much over the years. 🏀 1:7 @bballforever_  @NBA", "cleaned_tweet": "kobe goat say know mj lebron deserving want say always going debate amongst basketball fans categorised game changed much years"}
{"username": 1615026183296409601, "original_tweet": "LeBron losses = a injury report comes out ,, I’m ngl my GOAT your getting pretty predictable , just gone hang it up king 🤦🏾‍♂️😮‍💨😒💯 https://t.co/zXFWcFU8vb", "cleaned_tweet": "lebron losses injury report comes im ngl goat getting pretty predictable gone hang king"}
{"username": 1895873548587278336, "original_tweet": "@destrphforless Dont tweet about my Goat LeBron EVER! bitch https://t.co/1GUmAXaZ9B", "cleaned_tweet": "dont tweet goat lebron ever bitch"}
{"username": 1811221002581430272, "original_tweet": "@JassPreet96 The term \"GOAT (Greatest of All Time) is subjective and can refer to anyone considered the best in their field. For example, in sports, figures like Michael Jordan or Serena Williams are often labeled as the GOAT", "cleaned_tweet": "term goat greatest time subjective refer anyone considered best field example sports figures like michael jordan serena williams often labeled goat"}
{"username": 1866763775044403200, "original_tweet": "@JassPreet96 Michael Jordan defines 'GOAT.'", "cleaned_tweet": "michael jordan defines goat"}
{"username": 1063637292420489217, "original_tweet": "@jasonrmcintyre Lebron\n11 seasons cavs 1 ring\n7 seasons lakers 1 ring\n4 seasons miami 2 rings\n\nLebron won 3 rings in his first 15 seasons\nMJ won 6..2 3PEAT!!!! In his 15 season\n\n15 seasons total\nLebron 1143 27.2 pts ave 7.4 rebnds 7.2 asst\nMJ 1072 30.1 pts ave 6.2 rebnds 5.3 asst\nWho is GOAT?", "cleaned_tweet": "lebron seasons cavs ring seasons lakers ring seasons miami rings lebron rings first seasons mj peat season seasons total lebron pts ave rebnds asst mj pts ave rebnds asst goat"}
{"username": 1818835233401155584, "original_tweet": "@blahblah1207 LeBron is goat", "cleaned_tweet": "lebron goat"}
{"username": 1186255005977927682, "original_tweet": "@MarkTheTruth23 @BronGotGame steph about to blow another 3-1 lead to jalen green fool, that finals 3-1 don't mean nothing when the warriors are front running choke artists . doesn't change lebron being the goat of losing, 6 losses on the biggest stage is insane.", "cleaned_tweet": "steph blow another lead jalen green fool finals dont mean nothing warriors front running choke artists doesnt change lebron goat losing losses biggest stage insane"}
{"username": 1883978347530559488, "original_tweet": "**Player debates:**\n\nIn a world obsessed with putting LeBron in the GOAT convo, we're sleeping on PRIME Scottie Pippen. Imagine Pippen in today's game with the freedom to dominate as the no.1 option. A defensive maestro, a playmaking genius who was ahead of his time. In the right", "cleaned_tweet": "player debates world obsessed putting lebron goat convo sleeping prime scottie pippen imagine pippen todays game freedom dominate option defensive maestro playmaking genius ahead time right"}
{"username": 1403196654996627461, "original_tweet": "@hodgetwins And the Oscar for best drama queen goes to... LeBron James!", "cleaned_tweet": "oscar best drama queen goes lebron james"}
{"username": 1728872355231862784, "original_tweet": "@fasc1nate The LeBron James disrespect is WILD! MJ ain't even the best in his own sport OAT", "cleaned_tweet": "lebron james disrespect wild mj aint even best sport oat"}
{"username": 1906036776927404033, "original_tweet": "Rather Lie best music song, Timeless best Carti feature, Pop Out trash, Evil Jordan best ig single", "cleaned_tweet": "rather lie best music song timeless best carti feature pop trash evil jordan best ig single"}
{"username": 1278392177471533056, "original_tweet": "@LakeShowYo Same as LeBron.  He isn’t the GOAT.", "cleaned_tweet": "lebron isnt goat"}
{"username": 1481858530420400129, "original_tweet": "@ChoseNx0ne @HoodiPodz @Ar15Mvp @HoodiGarland Lebron goat case is unaffected by this 2-12 record over last 14 games wdym? No one who acc likes hoops is holding that against him.", "cleaned_tweet": "lebron goat case unaffected record last games wdym one acc likes hoops holding"}
{"username": 1882069624621330432, "original_tweet": "@The__Jeh I was gonna say haruka x chitose but the goat aseop came in like prime lebron https://t.co/LxTsdHy5B2", "cleaned_tweet": "gon na say haruka chitose goat aseop came like prime lebron"}
{"username": 1323072714287042561, "original_tweet": "@Shelton_Dmello @realManiAiyer @kevinwildes Yeah man im so sure its crickets when he fails 💀Its moreso LeBron is either the GOAT or 2nd best player ever in most peoples eyes so he gets more criticism. LeBron fans just fall back on “HES 40!!” when he does something good or bad", "cleaned_tweet": "yeah man im sure crickets fails moreso lebron either goat nd best player ever peoples eyes gets criticism lebron fans fall back hes something good bad"}
{"username": 1457477135669477377, "original_tweet": "all these lebron fans want curry to lose game 7 so bad 🤣🤣🤣 \n\nshit i’d be mad too if my goat got first rounded 3 years in a row hahahaha", "cleaned_tweet": "lebron fans want curry lose game bad shit id mad goat got first rounded years row hahahaha"}
{"username": 170994151, "original_tweet": "@LegionHoops @Trevor_Lane As long as the team had Lebron, there ALWAYS EXCUSES. Suddenly the WHOLE TEAM IS NOT HEALTHY, while complaining they are playing the BEST 6th seed. When they were the 3rd seed.  So u telling me Lakers get to 3rd seed is because of LUCK?", "cleaned_tweet": "long team lebron always excuses suddenly whole team healthy complaining playing best th seed rd seed telling lakers get rd seed luck"}
{"username": 1504222039326011398, "original_tweet": "Yup LeBron my goat we’ve in life seen the type of expectations placed upon a 40 year old man ever, at this point in his career he should be getting carried a ring but nah he’s expected to not be great but be the best player on the floor even for his advanced age! https://t.co/dEiYdNktP5", "cleaned_tweet": "yup lebron goat weve life seen type expectations placed upon year old man ever point career getting carried ring nah hes expected great best player floor even advanced age"}
{"username": 1219192651779428352, "original_tweet": "@GokuRunitup @Sonny_Rez @BallsackSports i think it’s more valid to lose 3-1 while playing injured and having some crazy shit happen like a suspension to ur best player that series, center out 2 games, etc. than getting swept multiple times (not even saying lebron) \n\nur right on it being less common tho", "cleaned_tweet": "think valid lose playing injured crazy shit happen like suspension ur best player series center games etc getting swept multiple times even saying lebron ur right less common tho"}
{"username": 1693785068949397504, "original_tweet": "lebron the goat fr fr", "cleaned_tweet": "lebron goat fr fr"}
{"username": 530850623, "original_tweet": "@MagicJohnson I have a question, how did Lebron get put above Magic in Goat Conversations? Magic was Unstoppable, Smooth, was a genius on the court, Tuff, Post moves, Rebound, Pure Winner, if I am an NBA GM I’m drafting magic over LeBron", "cleaned_tweet": "question lebron get put magic goat conversations magic unstoppable smooth genius court tuff post moves rebound pure winner nba gm im drafting magic lebron"}
{"username": 1288126295289655299, "original_tweet": "@HoopMixOnly NBA playoffs with out the @Lakers is boring, Lebron isn’t event top 5 best Lakers", "cleaned_tweet": "nba playoffs boring lebron isnt event top best lakers"}
{"username": 1258233938960510976, "original_tweet": "@paulieknep A much needed voice of reason\n\nJordan is the GOAT &amp; it’s has nothing to do w/\n\n- losing in R1 59,000 min deep or\n- rings or\n- finals record or\n- shoe sales or\n- “Saved” or\n- what “players say”\n\nLebron has earned his place in the debate w/ objective unprecedented greatness https://t.co/3fzwYHp9vA", "cleaned_tweet": "much needed voice reason jordan goat amp nothing losing min deep rings finals record shoe sales saved players say lebron earned place debate objective unprecedented greatness"}
{"username": 1835300353354461184, "original_tweet": "@Jordan_lc_ He’s one of the best around", "cleaned_tweet": "hes one best around"}
{"username": 1855247429567672320, "original_tweet": "@CedTheeGreat @oh_look_its_eli @e11644243 @EmbraceNAmplify @IWONTHEMONEY7 @LakeShowYo No, if you knew how to read I said it's not worth my time lol but I can explain to your dumbass why you're wrong. Yes it's a team sport, that being said LeBron has been gifted some of the best teammates in his career and still has managed to do minimal with them lol", "cleaned_tweet": "knew read said worth time lol explain dumbass youre wrong yes team sport said lebron gifted best teammates career still managed minimal lol"}
{"username": 2682893662, "original_tweet": "@LakeShowYo The same as LeBron's legacy after getting swept 5 times. Both not the goat", "cleaned_tweet": "lebrons legacy getting swept times goat"}
{"username": 1101202915216248832, "original_tweet": "@KeVonnGrantt @kanye_breasts @BIGMEM12 That subjective. He's got four chips with three on LeBrons dome. LeBron also wasn't the best player he got his ass whooped. He did fake a broken hand though that was cool", "cleaned_tweet": "subjective hes got four chips three lebrons dome lebron also wasnt best player got ass whooped fake broken hand though cool"}
{"username": 1147677023390724096, "original_tweet": "@Jahissshim @30_Dynasty Oh shit. I didn’t know any of that. How stupid of me!\n\nLebron won his last 6 game 7s. \nJordan his last 3\nHell, Kobe was 5-1 in them. \n\nBut Curry, the “GOAT,” has fans GIVING UP before the game?", "cleaned_tweet": "oh shit didnt know stupid lebron last game jordan last hell kobe curry goat fans giving game"}
{"username": 1590511316115943424, "original_tweet": "@LeBron__legacy Brooo, this is stupid ass hell, you sound as the other people saying the LeBron isn't the goat anymore for the series his lost", "cleaned_tweet": "brooo stupid ass hell sound people saying lebron isnt goat anymore series lost"}
{"username": 988549077678862336, "original_tweet": "@Jacobtheclipper I will never understand why anyone would ever compare him to Micheal Jordan because he isn’t no where near MJs level and it is an insult to the goat to do so", "cleaned_tweet": "never understand anyone would ever compare micheal jordan isnt near mjs level insult goat"}
{"username": 1364827391307227136, "original_tweet": "@veenap @RajChipalu What Rob did was smart get Luka who the Mavs stupidly traded for the Lakers future LeBron is 40 he is being selfish he will never be to GOAT over Jordan retire dude", "cleaned_tweet": "rob smart get luka mavs stupidly traded lakers future lebron selfish never goat jordan retire dude"}
{"username": 83783406, "original_tweet": "I'm in a Por vida mood because of pop but my other favorite sports team also dropping wholesome posting!\n- Wout saying MvDP 🫡\n- Tiesj's answer! 🤣\n- Jonas saying Pogi 🎇 (Fireworks on the tour baybeh!)\n- And the GOAT recognizing Puck's spring. Like LeBron telling Ant hit me up https://t.co/clhwdSrkWo", "cleaned_tweet": "im por vida mood pop favorite sports team also dropping wholesome posting wout saying mvdp tiesjs answer jonas saying pogi fireworks tour baybeh goat recognizing pucks spring like lebron telling ant hit"}
{"username": 1273111112, "original_tweet": "STOP LeBron is the GOAT no matter what 😭 https://t.co/BIhB8oPLzy", "cleaned_tweet": "stop lebron goat matter"}
{"username": 949033212, "original_tweet": "@kobeshaqphil @hardwoodjunkies @Trevor_Lane @Belgarath76 Those stats are very accurate. Lebron was the best defender in the playoffs at the rim n also like he said lead in stl n blocks", "cleaned_tweet": "stats accurate lebron best defender playoffs rim also like said lead stl blocks"}
{"username": 1590511316115943424, "original_tweet": "@BIGMEM12 \"I hope y'all know LeBron is never touching the GOAT convos again after losing at a worse seed with top 5 player of the league\"\n\nY'all sound too stupid", "cleaned_tweet": "hope yall know lebron never touching goat convos losing worse seed top player league yall sound stupid"}
{"username": 1559002923228487680, "original_tweet": "@LeBron__legacy if thats the case, why is mj not easily ur goat lol", "cleaned_tweet": "thats case mj easily ur goat lol"}
{"username": 42664678, "original_tweet": "@pixel_savant I don’t though, and if you think I do you are misinterpreting my statement and should read my other comments. I firmly believe LeBron could be considered the GOAT.", "cleaned_tweet": "dont though think misinterpreting statement read comments firmly believe lebron could considered goat"}
{"username": 1148156734780788736, "original_tweet": "@BiPolarBear3690 @Karlsefnni ur talking like this was decades ago LMFAO. with this logic why is there even a debate between MJ and lebron? u cant use this argument when everything evolves, then why does the word GOAT even exist when all time doesnt even matter, and only the present does? cmon bro💀", "cleaned_tweet": "ur talking like decades ago lmfao logic even debate mj lebron cant use argument everything evolves word goat even exist time doesnt even matter present cmon bro"}
{"username": 3312843185, "original_tweet": "@warriors Curry &amp; Butler Draymond. don’t have enough scoring help  to win another title. They are surrounded by G league starting talent at best  this is Fact  Steph’s last season is next year. Otherwise he’s just hanging on padding stats same as  AKA LeBron James", "cleaned_tweet": "curry amp butler draymond dont enough scoring help win another title surrounded league starting talent best fact stephs last season next year otherwise hes hanging padding stats aka lebron james"}
{"username": 1551640666446319616, "original_tweet": "Jordan James #20 with the best crowd silencer of the year https://t.co/knOPvPWAI4", "cleaned_tweet": "jordan james best crowd silencer year"}
{"username": 110638886, "original_tweet": "@DustinNemos2 @DBoomaSan @samusjeff @Jordan_Sather_ @PaTrumpGirl @BadlandsMedia_ Lol 🤣 you can't come to my level on your best day kiddo. That's why you haven't grown in years and never got into the trump camp. Laughing in billionaire", "cleaned_tweet": "lol cant come level best day kiddo thats havent grown years never got trump camp laughing billionaire"}
{"username": 1693736175884959744, "original_tweet": "Im sorry but the longer lebron plays the lower his \"goat\" status gets 6-0, 5-2 still better than 4-6 EVERYWAY YOU LOOK AT IT.", "cleaned_tweet": "im sorry longer lebron plays lower goat status gets still better everyway look"}
{"username": 1854110137952108546, "original_tweet": "@repeatedLs @Jacobtheclipper Kobe fans calls him the GOAT\nSteph Fans calls him the GOAT\nJordan fans calls him the GOAT\nKareem fans calls him the GOAT\nBron fans calls him the GOAT\n\nIt is literally just an era thing and who you watched growing up as a kid to an adult", "cleaned_tweet": "kobe fans calls goat steph fans calls goat jordan fans calls goat kareem fans calls goat bron fans calls goat literally era thing watched growing kid adult"}
{"username": 1229917539951620096, "original_tweet": "@BIGMEM12 It’s crazy how niggas say steph already stamped and solidified but not the best player of all time (arguably cause we know jordan stans be having periods)", "cleaned_tweet": "crazy niggas say steph already stamped solidified best player time arguably cause know jordan stans periods"}
{"username": 1854110137952108546, "original_tweet": "@repeatedLs @Jacobtheclipper Now that he has seen it\n\nLet's see what will happen\n\nMind you\nKobe fans says he is the GOAT and better than Jordan", "cleaned_tweet": "seen lets see happen mind kobe fans says goat better jordan"}
{"username": 1570093804211806208, "original_tweet": "15 best RBs after Skat and Tuten (in order) \n\nJaydon Blue\nDylan Sampson \nJarquez Hunter \nDevin Neal  \nTrevor Etienne\nDJ Giddens\nBrashard Smith \nWoody Marks \nJordan James \nKyle Monangai\nJacory Croskey-Merritt \nOllie Gordon \nDamien Martinez \nLaQuint Allen \nPhil Mafah", "cleaned_tweet": "best rbs skat tuten order jaydon blue dylan sampson jarquez hunter devin neal trevor etienne dj giddens brashard smith woody marks jordan james kyle monangai jacory croskeymerritt ollie gordon damien martinez laquint allen phil mafah"}
{"username": 1154355941216837633, "original_tweet": "I can show you a video montage of actual NBA players saying LeBron is the GOAT too. \n\nI’m not disrespecting Kobe at all either by the way just being objective and factual 🤷🏽‍♂️\n\nWhat’s not debatable is that MJ and Bron are definitely 1 and 2 no matter what order you have them. https://t.co/HSkkEmnyFP", "cleaned_tweet": "show video montage actual nba players saying lebron goat im disrespecting kobe either way objective factual whats debatable mj bron definitely matter order"}
{"username": 1147677023390724096, "original_tweet": "@AirJordans2323 @Suns @KingJames @Timberwolves @Jumpman23 In game 7 of the 2016 Finals, Lebron’s teammates scored 3 points combined in the last 9 minutes. Lebron scored 11 in the 4th. \n\nIn 87, Jordan went 0-6 in 4th in the elimination game.\n\nSee how this works?  Compare worst-to-worst and best-to-best. Not MJ’s best to Lebron’s worst. https://t.co/q8a4IZ9Oyb", "cleaned_tweet": "game finals lebrons teammates scored points combined last minutes lebron scored th jordan went th elimination game see works compare worsttoworst besttobest mjs best lebrons worst"}
{"username": 41401640, "original_tweet": "Nah, no GOAT gifs for you either. You gotta use gifs from loser ass niggaz like lebron....\n\nTry again. https://t.co/lev5WgfhcL", "cleaned_tweet": "nah goat gifs either got ta use gifs loser ass niggaz like lebron try"}
{"username": 1791457392942624768, "original_tweet": "@ZitoAmeriki @HoopMixOnly Yeah no best shooting duo of all time by a fucking LANDSLIDE, kevin durant is self explainable, and prime draymon green vs lebron and the goober squad. Look at our starting 5 in those years we might as well have been the cleveland lebrons", "cleaned_tweet": "yeah best shooting duo time fucking landslide kevin durant self explainable prime draymon green vs lebron goober squad look starting years might well cleveland lebrons"}
{"username": 1445628142563958784, "original_tweet": "@jordan_puff Best backshot\n\nhttps://t.co/OPzAUzIMeD", "cleaned_tweet": "best backshot"}
{"username": 1221385476206055424, "original_tweet": "@hardwoodjunkies @SwipaCam Meanwhile LeBron’s wins come from the bubble, baby Thunder, old Spurs who then proceeded to kick his ass in the biggest point differential Finals ever. Along with the most embarrassing finals performance for a proclaimed GOAT ever in 2011. Then got walked down by Curry 3 times", "cleaned_tweet": "meanwhile lebrons wins come bubble baby thunder old spurs proceeded kick ass biggest point differential finals ever along embarrassing finals performance proclaimed goat ever got walked curry times"}
{"username": 1529388598822199296, "original_tweet": "@Dittloff4Senate God bless Jordan, huge effort\n\nNot that my sample size is big, but there are way more people I know voting Libertarian than ever before, best of luck", "cleaned_tweet": "god bless jordan huge effort sample size big way people know voting libertarian ever best luck"}
{"username": 234951255, "original_tweet": "@1andonlyVis @ThomasRaphKahn_ He was never the goat. Kobe the goat but LeBron does alot of non lakers type shit. I don’t wanna see no limping or hear about the front office after a round 1 exit with championship expectations. Just take the loss on the chin, the theatrics are gay and trash", "cleaned_tweet": "never goat kobe goat lebron alot non lakers type shit dont wan na see limping hear front office round exit championship expectations take loss chin theatrics gay trash"}
{"username": 166865566, "original_tweet": "@NBA Alperen Sengun is the GOAT, LeBron could never 🤣", "cleaned_tweet": "alperen sengun goat lebron could never"}
{"username": 1030705084785602560, "original_tweet": "Jordan 14 Sneakers at the Best Price in Kenya\nhttps://t.co/sCF23pcadb\nJust Order It, We Deliver\n\nMatiang'i\nWarriors\nKisii\n#EternalGloryofTheLord\n#BloodParliament\n#bloodmoney\nGame 7\nBrian Adagala\n#RutoMustGo\nNicholas Gichuki\nMaguire\n#awesomeoutpour\n#FreeTheFilmmakers\nKaren", "cleaned_tweet": "jordan sneakers best price kenya order deliver matiangi warriors kisii game brian adagala nicholas gichuki maguire karen"}
{"username": 1030705084785602560, "original_tweet": "Jordan 3 Sneakers at the Best Price in Kenya\nhttps://t.co/WtrH8q1It1\nJust Order It, We Deliver\n\nMatiang'i\nWarriors\nKisii\n#EternalGloryofTheLord\n#BloodParliament\n#bloodmoney\nGame 7\nBrian Adagala\n#RutoMustGo\nNicholas Gichuki\nMaguire\n#awesomeoutpour\n#FreeTheFilmmakers\nKaren", "cleaned_tweet": "jordan sneakers best price kenya order deliver matiangi warriors kisii game brian adagala nicholas gichuki maguire karen"}
{"username": 1491885558, "original_tweet": "Michael Jordan new statue the goat. 😂🤣😝 https://t.co/hJe5A7C1TF", "cleaned_tweet": "michael jordan new statue goat"}
{"username": 1185394367214837761, "original_tweet": "@Joknotfinished I didn’t expect the depth to be bad, but I did expect Jaden mcdaniels and co to feast on Luka offensively all series\n\nAlso, no rim protector = more ant drives and open looks around\n\nLebron was the best lakers defender and he’s 40\n\nIdk what happened to reaves", "cleaned_tweet": "didnt expect depth bad expect jaden mcdaniels co feast luka offensively series also rim protector ant drives open looks around lebron best lakers defender hes idk happened reaves"}
{"username": 548600493, "original_tweet": "@TheDunkCentral You all are the most stupidest fans ever. Lebron was asked a question &amp; gave a real answer since y’all think he lying. What is wrong with what he said? You make the best decision for u not for me because I’m retiring in 2 years. How tf do you all have a problem with what he said", "cleaned_tweet": "stupidest fans ever lebron asked question amp gave real answer since yall think lying wrong said make best decision im retiring years tf problem said"}
{"username": 386029295, "original_tweet": "@NoLimitsRiq Shut the fuck up. Take that L. Lakers lost. It don't mean anything. Life goes on. Stop fantasizing LeBron like he he is the best human being in the whole universe. He don't know you nigga", "cleaned_tweet": "shut fuck take lakers lost dont mean anything life goes stop fantasizing lebron like best human whole universe dont know nigga"}
{"username": 973318140569489410, "original_tweet": "@HoopMixOnly He’s never DOMINANTED basketball… maybe you don’t know there’s a GOAT called Michael Jordan?", "cleaned_tweet": "hes never dominanted basketball maybe dont know theres goat called michael jordan"}
{"username": 1915220997181235202, "original_tweet": "@BlessedOrri @LakeShowYo LeBron been outta the goat convo since 2011 btw. MJ the goat 🐐", "cleaned_tweet": "lebron outta goat convo since btw mj goat"}
{"username": 1544604998213967872, "original_tweet": "@allthesmokeprod @Matt_Barnes22 @DaTrillStak5 @CraigHodgesNBA He smoking dope better than MJ how 🤣🤣🤣🤣 man I tell you when u beat people or take their shine they make up stuff. The tape never showed pippen on Jordan’s level it always shows he was a 2 at best never a 1", "cleaned_tweet": "smoking dope better mj man tell beat people take shine make stuff tape never showed pippen jordans level always shows best never"}
{"username": 1611212757377892352, "original_tweet": "The Season Michael Jordan Finally Became A CHAMPION! 1990-91 🏆🐐 GOAT SZN https://t.co/tcrmgFulU9 via @YouTube Love you Mike", "cleaned_tweet": "season michael jordan finally became champion goat szn via love mike"}
{"username": 1896762536508403712, "original_tweet": "😀Jordan Peterson said it best 😀\nDon't talk to people who aren't listing to you.\nWhen people are aggressive with you, stop talking to them and watch. \nThey will tell you everything you need to know about them, just so you know.", "cleaned_tweet": "jordan peterson said best dont talk people arent listing people aggressive stop talking watch tell everything need know know"}
{"username": 1311753873867104261, "original_tweet": "@LuckyGio2 @LakeShowYo LeBron can’t be considered the goat anymore then 🙃", "cleaned_tweet": "lebron cant considered goat anymore"}
{"username": 1605524818950238211, "original_tweet": "Greatness comes with HUMILITY.\nLeBron flops, lies, is a traitor, has no loyalty, and begs people to call him the best.\n\n#LeBronJames is a b*tch. Oh yes, he has money.\nLeBron James is a rich b*tch!\n\n#GOAT #NBAPlayoffs https://t.co/yR2VgzyWk9", "cleaned_tweet": "greatness comes humility lebron flops lies traitor loyalty begs people call best btch oh yes money lebron james rich btch"}
{"username": 1087701591484968962, "original_tweet": "@BIGMEM12 Proof LeBron is narcissistic.. when he losses it’s someone’s else’s fault or injury ; when he wins he’s “the goat” in his world he always wins . Narcissism. You can’t fool everyone by your acting 🎭", "cleaned_tweet": "proof lebron narcissistic losses someones elses fault injury wins hes goat world always wins narcissism cant fool everyone acting"}
{"username": 1584072560739696640, "original_tweet": "@BronGotGame LeBron is not the goat", "cleaned_tweet": "lebron goat"}
{"username": 1597338349429293058, "original_tweet": "@HoopMixOnly Lebron won 13 finals. This is why he is the goat", "cleaned_tweet": "lebron finals goat"}
{"username": 1499884901084114949, "original_tweet": "@HoopMixOnly “You don’t mean that” not my goat LeBron don’t say that 😂😂😭😭. https://t.co/33PoopvzPB", "cleaned_tweet": "dont mean goat lebron dont say"}
{"username": 1184587934286008320, "original_tweet": "@BallMuse23 Donovan “almost a star” Mitchell over arguably the best championship ever is egregious. The LeBron CLE championship team is the peak. Use your fuckin head bro lol", "cleaned_tweet": "donovan almost star mitchell arguably best championship ever egregious lebron cle championship team peak use fuckin head bro lol"}
{"username": 1779795188862595072, "original_tweet": "@tweet7picksoul Hey Jordan! At AJIO, we are customer oriented and we ensure nothing but the best for our customers. Nothing makes us happier than getting your order delivered to you. However, sometimes due to unavoidable circumstances, we are forced to cancel the order. We understand (1/3)", "cleaned_tweet": "hey jordan ajio customer oriented ensure nothing best customers nothing makes us happier getting order delivered however sometimes due unavoidable circumstances forced cancel order understand"}
{"username": 1450909067279433734, "original_tweet": "Curry is a goat but LeBron cemented himself like\nNo other player against such a team. They had to get Durant the next year lol https://t.co/m8ydBPJTVO https://t.co/8QvDZiZlBo", "cleaned_tweet": "curry goat lebron cemented like player team get durant next year lol"}
{"username": 1531782417601683456, "original_tweet": "@gasmaskatl i’ve found this discussion mostly effects the recent player actually- brady &amp; lebron.. as someone who thinks Jim Brown is probably the football goat even knowing he probably played against plummers…", "cleaned_tweet": "ive found discussion mostly effects recent player actually brady amp lebron someone thinks jim brown probably football goat even knowing probably played plummers"}
{"username": 1044108354, "original_tweet": "Lebron James And The Lakers Lose Michael Jordan Is The Goat ~ KUVE Today at 3pm CST on https://t.co/rgbKnWvOZX https://t.co/4bL8jpt8T2", "cleaned_tweet": "lebron james lakers lose michael jordan goat kuve today pm cst"}
{"username": 1810419025027162112, "original_tweet": "@LeBron__legacy LeBron is your goat", "cleaned_tweet": "lebron goat"}
{"username": 563375038, "original_tweet": "Lmao so not only was LeBron “injured” but now it’s coming out that everyone else was too. \n\nJust say “we lost in 5 at our best,” stop making excuses it’s so pathetic https://t.co/TWmdIqW8xO", "cleaned_tweet": "lmao lebron injured coming everyone else say lost best stop making excuses pathetic"}
{"username": 1489791615581437955, "original_tweet": "@BruschiGod @knicks_tape99 😂😂😂 LeBron post prime expected to be prime. That's how you know he's the GOAT.", "cleaned_tweet": "lebron post prime expected prime thats know hes goat"}
{"username": 1501731833104543745, "original_tweet": "@Jordan_Deeb Def not the very best time I let loose however I do often do so and this time one of my brothers will be DD so it’s all chill. I’m having a grand time and I’ll probs update late. Ty📚&lt;3333", "cleaned_tweet": "def best time let loose however often time one brothers dd chill im grand time ill probs update late tylt"}
{"username": 597678311, "original_tweet": "The man is 4-6 in finals. LeBron has a higher chance to lose a finals than for you to flip a coin and get tails. You can’t lose the finals SIX TIMES and be the goat lol https://t.co/4YBDVRVOaS", "cleaned_tweet": "man finals lebron higher chance lose finals flip coin get tails cant lose finals six times goat lol"}
{"username": 563375038, "original_tweet": "Lebron James needs MORE THAN LUKA to get past the first round. \n\nHe isn’t the GOAT lmao. https://t.co/NtpQSLrFxa", "cleaned_tweet": "lebron james needs luka get past first round isnt goat lmao"}
{"username": 1410215323907809288, "original_tweet": "@LakeShowYo He gets eliminated from the GOAT convo forever just like LeBron. Never use those 2 terms together again.", "cleaned_tweet": "gets eliminated goat convo forever like lebron never use terms together"}
{"username": 1560087528, "original_tweet": "@LakeShowYo Who will step blame after first round exit?\nThat's why Jordan will always be goat 🤣", "cleaned_tweet": "step blame first round exit thats jordan always goat"}
{"username": 1186255005977927682, "original_tweet": "@Joe35878785 @BronGotGame Since the 80s , Lebron is the only superstar to get swept twice in the finals … so no people don’t get swept in the finals all the time.\n\nFor LeBron to have been swept twice in the finals makes him the GOAT of losing.", "cleaned_tweet": "since lebron superstar get swept twice finals people dont get swept finals time lebron swept twice finals makes goat losing"}
{"username": 1042385519466954753, "original_tweet": "@AndrewHenderson @Jacobtheclipper Well tbh he did say LeBron can’t do it NOW. That’s true, LeBron now needs somebody to be the number one while he takes a backseat. That’s why he will never be considered the GOAT.", "cleaned_tweet": "well tbh say lebron cant thats true lebron needs somebody number one takes backseat thats never considered goat"}
{"username": 702571179773718528, "original_tweet": "@LockSmith15270 Retire pleeeeease! Top 3 GOAT!\n(Jordan &amp; Kareem are ahead of him)", "cleaned_tweet": "retire pleeeeease top goat jordan amp kareem ahead"}
{"username": 1374261070601199617, "original_tweet": "@HoopMixOnly Playoffs without lebron is the best thing, no flopping to the highest level, no complaining to the highest level, no faking injury when losing to the highest level and many many more! 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "cleaned_tweet": "playoffs without lebron best thing flopping highest level complaining highest level faking injury losing highest level many many"}
{"username": 785948736698671104, "original_tweet": "No notes, literally one of the best movies I’ve seen in a while\n\n*invisible ink*\n\nAlso, Michael B. Jordan….i have nothing ladylike to say https://t.co/raQn6Aipqe", "cleaned_tweet": "notes literally one best movies ive seen invisible ink also michael jordani nothing ladylike say"}
{"username": 919173955528941568, "original_tweet": "im ngl i hope lebron doesnt retire after this bc i dont wanna be a fan of the team that lead to the goat's exit 😭", "cleaned_tweet": "im ngl hope lebron doesnt retire bc dont wan na fan team lead goats exit"}
{"username": 1393096890644766722, "original_tweet": "@psssszzz Where is the Best of the best Chris Jordan", "cleaned_tweet": "best best chris jordan"}
{"username": 2511642617, "original_tweet": "AD in late January: “I’ve felt like I’ve always been my best when I’ve been the LeBron and Luka.", "cleaned_tweet": "ad late january ive felt like ive always best ive lebron luka"}
{"username": 1880640560299745280, "original_tweet": "@ChoseNx0ne @HoodiPodz @Ar15Mvp @HoodiGarland i mean do we move lebron out of the goat convo when he got 1st round exit? no right? some just made fun or hate which is a normal thing nothing new so why are we having convos that steph get banished from the all time greats? doesn't make sense", "cleaned_tweet": "mean move lebron goat convo got st round exit right made fun hate normal thing nothing new convos steph get banished time greats doesnt make sense"}
{"username": 1486655257409204229, "original_tweet": "@A2cozy Jordan still the goat", "cleaned_tweet": "jordan still goat"}
{"username": 2262932935, "original_tweet": "@purplepingers All the best, Jordan! It’s just a start", "cleaned_tweet": "best jordan start"}
{"username": 29841205, "original_tweet": "Me and Pops are in agreement about two pivotal things, Hov the best and LeBron is the GOAT.", "cleaned_tweet": "pops agreement two pivotal things hov best lebron goat"}
{"username": 86819225, "original_tweet": "@HoopMixOnly Jordan won six titles In the final stages of several games, securing victory in the final seconds, you gave the ball to your best player. LeBron is not a Goat, he doesn't have the mentality of a Goat, He prefers to throw himself on the floor than to carry the team and win games.", "cleaned_tweet": "jordan six titles final stages several games securing victory final seconds gave ball best player lebron goat doesnt mentality goat prefers throw floor carry team win games"}
{"username": 936437868305797123, "original_tweet": "@ode_jordan @MGGirlshoops @MGActivities @MSU_WBasketball Congratulations Jordan! You are a great person and wishing you nothing but the best!", "cleaned_tweet": "congratulations jordan great person wishing nothing best"}
{"username": 2284658890, "original_tweet": "@NanobeatzMike @LaughingToken @Ceo_Branding Bitch ass nigga you couldn’t respond to my other points. Why aren’t most of the greats who played in the NBA calling LeBron the GOAT? 🤡😂 Why? Cause they know Jordan the real GOAT 💯 https://t.co/DkMDRUH4eK", "cleaned_tweet": "bitch ass nigga couldnt respond points arent greats played nba calling lebron goat cause know jordan real goat"}
{"username": 143899679, "original_tweet": "@LakeShowYo LeBron fan sit down. Your goat got swept in the finals \nFucking bum", "cleaned_tweet": "lebron fan sit goat got swept finals fucking bum"}
{"username": 1771563193657155584, "original_tweet": "@slicg2k @BarryOnHere This is the problem dude. You can consider Bron your goat, but to act like it’s not close, or that Jordan is a fraud and doesn’t have a case is just low IQ casual talk with no respect for NBA history. And that’s what riles up MJ fans to start the trash talk.", "cleaned_tweet": "problem dude consider bron goat act like close jordan fraud doesnt case low iq casual talk respect nba history thats riles mj fans start trash talk"}
{"username": 965434474442915840, "original_tweet": "@MarkusTayl24538 @NG101la @IWONTHEMONEY7 @LakeShowYo Bro the only reason why LeBron is held to a higher standard is because some people think he’s the GOAT. Therefore, he’s held to GOAT standards. I", "cleaned_tweet": "bro reason lebron held higher standard people think hes goat therefore hes held goat standards"}
{"username": 1656953183514816514, "original_tweet": "BRAVO @AGJamesUthmeier \nFINALLY, someone with a spine...who is NOT corrupt! He supports Trump!He respects the oath he took! He keeps Americans best interests in the forefront.  \nListen &amp; learn how to get a spine @SpeakerJohnson @LeaderJohnThune @SenateGOP @Jim_Jordan @GOP https://t.co/xhDCGoSaZI", "cleaned_tweet": "bravo finally someone spinewho corrupt supports trumphe respects oath took keeps americans best interests forefront listen amp learn get spine"}
{"username": 1237043058950254592, "original_tweet": "The best part of the MJ LeBron talk, is the fact that if there is a conversation, that says all you need to know about LeBron, even if he isn’t consider by some to be in the convo, you know how great you got to be for people to say you aren’t as good as MJ…let That sink in..", "cleaned_tweet": "best part mj lebron talk fact conversation says need know lebron even isnt consider convo know great got people say arent good mjlet sink"}
{"username": 1460829114911313925, "original_tweet": "@LakeShowYo Just like Lebron. He’s like 2-12 or 2-14 in his last playoff games and he’s still the GOAT to people, likewise Steph isn’t some scrub just because at 37 he can’t win every series. \nLakers lost in 5. \nIf warriors lose in 7, it is what it is. \nIt’s a young man’s league 🤷🏻‍♂️", "cleaned_tweet": "like lebron hes like last playoff games hes still goat people likewise steph isnt scrub cant win every series lakers lost warriors lose young mans league"}
{"username": 3863137185, "original_tweet": "@DannyAzhar89 @LakeShowYo But if it’s LeBron “the GOAT doesn’t do this”", "cleaned_tweet": "lebron goat doesnt"}
{"username": 347339985, "original_tweet": "22 seasons and never missed a season\n\nBron is so durable he isn't allowed an injury\n\nJust another reason Lebron is the Goat 🐐 👑 https://t.co/pSvMsRm0dh https://t.co/RA7ipaEjtP", "cleaned_tweet": "seasons never missed season bron durable isnt allowed injury another reason lebron goat"}
{"username": 1493508769556447233, "original_tweet": "@probablynottah @oldskoolbballx Good? \n\nMichael Jordan is the indisputable GOAT.", "cleaned_tweet": "good michael jordan indisputable goat"}
{"username": 1804589431846019072, "original_tweet": "@HoopMixOnly This is dumb he also took L’s with all of them to, yall try so hard to make dude the best when it’s apparent that he’s not Jordan actually accomplished more in full 13 seasons then LeBron has in 22 seasons,.", "cleaned_tweet": "dumb also took ls yall try hard make dude best apparent hes jordan actually accomplished full seasons lebron seasons"}
{"username": 1832490387685941248, "original_tweet": "@ncksmith @TonyTMPokemon1 @TodayInSportsCo but a career 27% 3 point shooter mastered the game💀💀💀💀💀yall contradict yall selves with every goat argument. “more rings” well then russell should be your goat ”expansion era” well jordan won his first rings when there were only 25 teams", "cleaned_tweet": "career point shooter mastered gameyall contradict yall selves every goat argument rings well russell goat expansion era well jordan first rings teams"}
{"username": 1918277424447422464, "original_tweet": "@HoodiZeebo doing his best Lebron impression. if he isn’t better in game 7 he gonna be heading home in the first round like Lebron too", "cleaned_tweet": "best lebron impression isnt better game gon na heading home first round like lebron"}
{"username": 1375578108800077826, "original_tweet": "@Shane00 MJ was nice at 40, his team just was ass so we can’t fault him for that.\n\nKobe wasn’t stat padding, he was trying his best but never could make a comeback after that Achilles injury.\n\nLeBron put it so much work at this point he can do whatever the fuck he wants especially since", "cleaned_tweet": "mj nice team ass cant fault kobe wasnt stat padding trying best never could make comeback achilles injury lebron put much work point whatever fuck wants especially since"}
{"username": 1261929114304311297, "original_tweet": "The fans in Cleveland really pisses me off. You will thank him for bringing the only championship to Cleveland sports but u will add disrespect to him saying oh he is an entitled person or who will destroy the team LOL. LeBron at 40 is still the best player. https://t.co/NgBEgDZuOJ", "cleaned_tweet": "fans cleveland really pisses thank bringing championship cleveland sports add disrespect saying oh entitled person destroy team lol lebron still best player"}
{"username": 107614002, "original_tweet": "@braves2430 All in their prime would be bananas.\n\nBird &amp; Kobe on the court together, in that situation, would be theater.\n\nShort game, Bird + Magic. Longer game, Kobe &amp; LeBron. Best I’ve got.", "cleaned_tweet": "prime would bananas bird amp kobe court together situation would theater short game bird magic longer game kobe amp lebron best ive got"}
{"username": 1791492067371429889, "original_tweet": "@Lebronin1 @LakeShowYo so lebron isn’t the goat cuz he lost with luka in 5 with that logic", "cleaned_tweet": "lebron isnt goat cuz lost luka logic"}
{"username": 1475729705873690627, "original_tweet": "@therealfabris @BurnerExcellent @TJssWay @LakeShowYo Shi 20 fts a night? lol we wish he could get that type of whistle every night the nba knows damn well not to give him that whistle lmao. Lowkey he could average 40 and bud stocks would definitely be high LeBron is so efficient and the best all around player", "cleaned_tweet": "shi fts night lol wish could get type whistle every night nba knows damn well give whistle lmao lowkey could average bud stocks would definitely high lebron efficient best around player"}
{"username": 1680950494112432129, "original_tweet": "@SlothKnowsBall @Dom_2k Tatums passing LeBron in rings too that’s the best part", "cleaned_tweet": "tatums passing lebron rings thats best part"}
{"username": 255713129, "original_tweet": "LeBron Fans hating on Curry cause they goat is out 🤣😂🤣😂🤣😂🤣", "cleaned_tweet": "lebron fans hating curry cause goat"}
{"username": 1667751391551430657, "original_tweet": "BEST PROPS TODAY! \n\nDon’t miss this yall , show some love and also use code FSS for \n-Underdog fantasy\n-Sleeper fantasy\n-chalkboard fantasy\n\n-For up to $1000 in bonus credits \n-Free 0.5 Square LeBron James \n\n#nba #sports #prizepicks https://t.co/vBm9ORKCrd", "cleaned_tweet": "best props today dont miss yall show love also use code fss underdog fantasy sleeper fantasy chalkboard fantasy bonus credits free square lebron james"}
{"username": 1532964996111552513, "original_tweet": "@TheMekoCash @BronGotGame Even if you start at 08 when curry was drafted lebron has\n\nMore rings as the best player\nMore mvps\nMore fmvp\nMore finals appearances \nMore All star games\nMore all nba \nMore all defense \nMore points\nMore assist\nMore steals\nMore rebounds\nMore blocks\n\nAll playoff regular and finals", "cleaned_tweet": "even start curry drafted lebron rings best player mvps fmvp finals appearances star games nba defense points assist steals rebounds blocks playoff regular finals"}
{"username": 1637851804707717121, "original_tweet": "Got a few 🔥 one-offs to move between sales! Shipped &amp; Stacked pricing below:\n\nDerik Queen Black Wave Auto: $55 / $50\n\nElly De La Cruz HFA: $45 / $40\n\nJordan Lawlar Bowman's Best Auto: $22 PWE / $20 https://t.co/zV3rs912Zd", "cleaned_tweet": "got oneoffs move sales shipped amp stacked pricing derik queen black wave auto elly de la cruz hfa jordan lawlar bowmans best auto pwe"}
{"username": 1355612549090324489, "original_tweet": "Two completely different warriors teams, Lebron did that against one of the best teams ever and he’s doing it against a older warriors team https://t.co/DymP1F6h3w https://t.co/7BNGrzudQs", "cleaned_tweet": "two completely different warriors teams lebron one best teams ever hes older warriors team"}
{"username": 1593433651877883904, "original_tweet": "@LuckyYuckie @NanobeatzMike @BK9419 Most in goat debate. West is never mentioned. Yall lebron fans have no knowledge of goat lineage. You just love Lbj and think even though he lost he can still be over guy who had more success in less time. All LeBron did was accumulate stats. Absence of at least 5 rings hurts", "cleaned_tweet": "goat debate west never mentioned yall lebron fans knowledge goat lineage love lbj think even though lost still guy success less time lebron accumulate stats absence least rings hurts"}
{"username": 1891401060670906368, "original_tweet": "@Brandonman02 @RealSkipBayless It’s obvious LeBron beating the 2016 Warriors is what started the goat debate stuff and skip admittedly was a curry fan (said curry should go #1 over Blake in their draft)", "cleaned_tweet": "obvious lebron beating warriors started goat debate stuff skip admittedly curry fan said curry go blake draft"}
{"username": 1678084307100012544, "original_tweet": "Here is the difference though\n\nMJ and Kobe tried their best to convince you they were not injured when they were \n\nLeBron convinces you he's injured when he's not \n\nMJ and Kobe didn't make excuses or ever use injuries as excuse \n\nLeBron has done that a thousand times https://t.co/pz7cFao6ri", "cleaned_tweet": "difference though mj kobe tried best convince injured lebron convinces hes injured hes mj kobe didnt make excuses ever use injuries excuse lebron done thousand times"}
{"username": 1902238443603922944, "original_tweet": "@heatjon @smarkhenry23 @shendy456 Nobody cares about wizards Jordan , that's the whole point. Lebron is pathetic because he's in year 22 and wether he admits it or not , he's chasing the goat , he's not adding to his legacy and that's also evident because he's a loser. Jordan came back from 2 years of absence.", "cleaned_tweet": "nobody cares wizards jordan thats whole point lebron pathetic hes year wether admits hes chasing goat hes adding legacy thats also evident hes loser jordan came back years absence"}
{"username": 1518684816300032000, "original_tweet": "@uhhidkk21 @TonyTMPokemon1 @TodayInSportsCo When was all of that put together? I’d argue LeBron was the best during Cle 2.0. He struggled shooting in Miami. Terrible defender in LA. \nAnd has always sucked at FT", "cleaned_tweet": "put together id argue lebron best cle struggled shooting miami terrible defender la always sucked ft"}
{"username": 973317177242628096, "original_tweet": "Lakers and warriors really had a great run this season after the trade. The “goat” Lebron 1-4 and the “chef” blowing 3-1 leads. 😂 both will retire with 4 rings. It is what it is.", "cleaned_tweet": "lakers warriors really great run season trade goat lebron chef blowing leads retire rings"}
{"username": 1640351674274390016, "original_tweet": "@JoseLAL23 @LakeShowYo Lakers best player Luca is a traffic cone, Good luck trying to build a team around that, with LeBron taking $80 billion from the salary. 🤣", "cleaned_tweet": "lakers best player luca traffic cone good luck trying build team around lebron taking billion salary"}
{"username": 3263033720, "original_tweet": "If you’re LeBron, you must know deep down that the Lakers have Luka now. It’s in the teams best interest to allocate Lebrons salary toward a reliable center and multiple solid role players. @KingJames @Lakers @LADEig @ShannonSharpe @RealSkipBayless", "cleaned_tweet": "youre lebron must know deep lakers luka teams best interest allocate lebrons salary toward reliable center multiple solid role players"}
{"username": 1080740276728061952, "original_tweet": "@BestBallJunkie @pantsmansser1 @robinlundberg Your argument is biased based off numbers LeBron is better than your GOAT. He has a careers triple double Jordan doesn’t….cope harder little man", "cleaned_tweet": "argument biased based numbers lebron better goat careers triple double jordan doesntcope harder little man"}
{"username": 254703016, "original_tweet": "@big_business_ Your trash ass lakers got Luka and Lebron and your goat Bron faking injuries everyone he loses stfu fattty", "cleaned_tweet": "trash ass lakers got luka lebron goat bron faking injuries everyone loses stfu fattty"}
{"username": 381042072, "original_tweet": "LeBron James - perhaps the best athlete in NBA history - was forced to do this for 2.5 months, he was EXHAUSTED by the end of the season.\n\nAnd yet, the Warriors have asked a 6’5 guy, to play center for FOUR YEARS.\n\nIt’s unconscionable. Genuinely lmao https://t.co/6Gj2oXTx9e", "cleaned_tweet": "lebron james perhaps best athlete nba history forced months exhausted end season yet warriors asked guy play center four years unconscionable genuinely lmao"}
{"username": 1518684816300032000, "original_tweet": "@ViraL_Overkill @TonyTMPokemon1 @TodayInSportsCo The game plan against LeBron in the finals was to let him shoot.\nThe most complete LeBron was his 2nd stint in Cle. If he had that for more than 4 years, I’d have him as the goat.", "cleaned_tweet": "game plan lebron finals let shoot complete lebron nd stint cle years id goat"}
{"username": 1220887063689682944, "original_tweet": "@TheHateCentral So IF STEPH CURRY LOSE AND LET THE ROCKETS MAKE HISTORY AND COME BAK FROM A 3-1 lead does this hurt his legacy or THAT DOUBLE STANDARD SHIT ONLY APPLIES TO GOAT LEBRON JAMES", "cleaned_tweet": "steph curry lose let rockets make history come bak lead hurt legacy double standard shit applies goat lebron james"}
{"username": 1482107433661071361, "original_tweet": "@BillboardChris @mean_vagine You're Canadian. The whole reason I'm 100% against any part of Canada becoming America. You and Jordan peterson proved that even some of the best of you are still leftists", "cleaned_tweet": "youre canadian whole reason im part canada becoming america jordan peterson proved even best still leftists"}
{"username": 1869553007890972672, "original_tweet": "@BlessedOrri @DdUnderestimxte LeBron fans are interesting at best", "cleaned_tweet": "lebron fans interesting best"}
{"username": 1473359900369686532, "original_tweet": "@xbaiterof_rage @pantsmansser1 @robinlundberg Yes, he is really good at 40 throwing himself to the ground when he bumps a smaller white guy.   You must be so proud of that high level play!     You Worship a Fraud!   Michael Jordan is the GOAT.   Sorry", "cleaned_tweet": "yes really good throwing ground bumps smaller white guy must proud high level play worship fraud michael jordan goat sorry"}
{"username": 811898292, "original_tweet": "@RamonIsHim I still miss Jordan Poole man\n\nShould have sent Dray packing and kept our best young player 😭😭😭", "cleaned_tweet": "still miss jordan poole man sent dray packing kept best young player"}
{"username": 1869553007890972672, "original_tweet": "@BlessedOrri @DdUnderestimxte That’s a feeble list at best. Kobe WON 3 with ONE super star. He won 2 without even a top 75. As a matter of fact Pau was no where near Hall of Fame until who I wonder? LeBron needed people to close, all Kobe needed was four air balls as a pup to motivate HIMSELF!", "cleaned_tweet": "thats feeble list best kobe one super star without even top matter fact pau near hall fame wonder lebron needed people close kobe needed four air balls pup motivate"}
{"username": 1857099356647600128, "original_tweet": "@HoopMixOnly Less distractions from a diva who thinks he's the goat when he can't crack top 10. Later LeBron rest in piss . Couldn't even wear an original number. PHAGGOT", "cleaned_tweet": "less distractions diva thinks hes goat cant crack top later lebron rest piss couldnt even wear original number phaggot"}
{"username": 420427020, "original_tweet": "@PlugLifeHoops @Herbagurb @wico6 @EricRausch @Trevor_Lane was lebron james the best defender on his team while still putting up good numbers in the playoffs, yes or no?", "cleaned_tweet": "lebron james best defender team still putting good numbers playoffs yes"}
{"username": 1734886671814930432, "original_tweet": "@BronGotGame It won’t. It’s not Steph’s fault. LeBron isn’t the goat, he got bounced out of the first round again and he’s 2-12 in his last 14 playoff games. That affects LeCucks legacy.", "cleaned_tweet": "wont stephs fault lebron isnt goat got bounced first round hes last playoff games affects lecucks legacy"}
{"username": 1396699678260043776, "original_tweet": "oh but lebron can get swept like 4 times and still definitely be in the goat convo. yeah that makes sense https://t.co/x0Em16pegH", "cleaned_tweet": "oh lebron get swept like times still definitely goat convo yeah makes sense"}
{"username": 1911565646531289088, "original_tweet": "@SloHoopsFan Championship shape isn’t just solely about being PHYSICALLY in shape but also mentally. Luka went through what he went through, LeBron has been ailing physically, Austin seemingly being thrust into the “3rd best player” category.\n\nIt’s not always about Luka. Stop being sensitive", "cleaned_tweet": "championship shape isnt solely physically shape also mentally luka went went lebron ailing physically austin seemingly thrust rd best player category always luka stop sensitive"}
{"username": 1779466753002573824, "original_tweet": "@FastbreakHoops5 That 2016 Finals win against the 73-9 Warriors was definitely a GOAT moment for LeBron. Coming back from 3-1 down and delivering that block, it’s hard to argue with him claiming that title! 👑", "cleaned_tweet": "finals win warriors definitely goat moment lebron coming back delivering block hard argue claiming title"}
{"username": 1608269675967692800, "original_tweet": "I’m too old to be doing a lot of the stuff I do but im still the goat. I’m like LeBron but to the streets.", "cleaned_tweet": "im old lot stuff im still goat im like lebron streets"}
{"username": 1454502560308596741, "original_tweet": "@BleacherReport @mcten Get better soon LeBron ! The Goat", "cleaned_tweet": "get better soon lebron goat"}
{"username": 1854110137952108546, "original_tweet": "@Jacobtheclipper Thats the dumbest thing I've heard 😂 \nSo Kobe and Steph fans are allowed to call them the Goat but when a Lebron fan calls Bron the goat it is an issue \n\nThat is a weak excuse and you know it", "cleaned_tweet": "thats dumbest thing ive heard kobe steph fans allowed call goat lebron fan calls bron goat issue weak excuse know"}
{"username": 4198570775, "original_tweet": "@NanobeatzMike @ThundaJ739 @Ceo_Branding Also you blamed his teammates ummm LeBron news flash was part of the issue don't go out there goat this and that when he can't put up shit in the most important part of the game yet throws stuff up", "cleaned_tweet": "also blamed teammates ummm lebron news flash part issue dont go goat cant put shit important part game yet throws stuff"}
{"username": 1447217244577177609, "original_tweet": "@playoffriser_ @BallsackSports I don’t think most Curry fans gaf about the goat convo. That’s Jordan old head fans", "cleaned_tweet": "dont think curry fans gaf goat convo thats jordan old head fans"}
{"username": 1345268820085264384, "original_tweet": "When LeBron James was the best player in the world, he went to 8 straight Finals. You worried about the wrong thing when Mistah Joker has a 1st round Game 7 tomorrow https://t.co/MHxeYb6t5a", "cleaned_tweet": "lebron james best player world went straight finals worried wrong thing mistah joker st round game tomorrow"}
{"username": 1854110137952108546, "original_tweet": "@Jacobtheclipper Wait so Lebron Fans arent allowed to call him the goat? What sense does that make 😂 \nBeing the \"Goat\" is an opinion, not a fact\n\nSteph Curry fans says he is the Goat or the Greatest PG of all time over Magic Johnson", "cleaned_tweet": "wait lebron fans arent allowed call goat sense make goat opinion fact steph curry fans says goat greatest pg time magic johnson"}
{"username": 1502727030797914116, "original_tweet": "@ikeolu97767 @Catch23Brand That th worst part they say anything nd people stuupid will believe le\nbron th goat but i have th feeling in 2050 people realize and appreciate th greatness and amazingness of lebron but i am afraid by that year wemby luka flagg edwards shai jokic make finals career perjury bron", "cleaned_tweet": "th worst part say anything nd people stuupid believe le bron th goat th feeling people realize appreciate th greatness amazingness lebron afraid year wemby luka flagg edwards shai jokic make finals career perjury bron"}
{"username": 65958041, "original_tweet": "@LakeShowYo Still best LeBron 3 times in the finals.  He’s legacy is good.", "cleaned_tweet": "still best lebron times finals hes legacy good"}
{"username": 1715365628419227648, "original_tweet": "@mete_mem @D3riusVonG @HoopMixOnly He didn't Miss in the finals! 6/6\nLeBron lost 6 times 4/10  🤮 &amp; Swept twice rt? How can a \"GOAT\" play 8 finals games &amp; not win at least when facing elimination-humiliation? ☝️ 😩 BTW: (KOBE's Never been 🧹 in the finals.) Is this even a discussion? Or is this LJ's burner?", "cleaned_tweet": "didnt miss finals lebron lost times amp swept twice rt goat play finals games amp win least facing eliminationhumiliation btw kobes never finals even discussion ljs burner"}
{"username": 1862566371671912448, "original_tweet": "@BronWorld Can you please stop comparing LeBron? Who’s a loser in the finals and everywhere else to my goat who’s undefeated in the finals?", "cleaned_tweet": "please stop comparing lebron whos loser finals everywhere else goat whos undefeated finals"}
{"username": 1288344847540076546, "original_tweet": "@Jim_Jordan He inherited the best economy growth in the world. You always look away when somebody is getting fucked against their will.", "cleaned_tweet": "inherited best economy growth world always look away somebody getting fucked"}
{"username": 1735846139436343296, "original_tweet": "@strifeomg MJ will always be the goat 🐐 \nDude was given the ball more than any other player in history when thebgame was on the line.\n\nEvery single defense prepared to no avail. None of them could stop Jordan and his game winning daggers.", "cleaned_tweet": "mj always goat dude given ball player history thebgame line every single defense prepared avail none could stop jordan game winning daggers"}
{"username": 1820204830922588164, "original_tweet": "@teroyaeason Lebron fans are on your side Goat", "cleaned_tweet": "lebron fans side goat"}
{"username": 1685243429188755457, "original_tweet": "@LakeShowYo LEBRON THE GOAT", "cleaned_tweet": "lebron goat"}
{"username": 888098930210127872, "original_tweet": "Best offensive center ever lost 2 Game 7s at home b2b years\n\nModern Day Michael Jordan lost to a team that can’t defend with 6 players and one of them is Westbrook \n\nUnanimous got worked by FVV again \n\nPrepacked agendas. Get ready https://t.co/GFk3iVWqHo", "cleaned_tweet": "best offensive center ever lost game home bb years modern day michael jordan lost team cant defend players one westbrook unanimous got worked fvv prepacked agendas get ready"}
{"username": 1708494863660969984, "original_tweet": "@MrAByrd @HoodiiLuka @TheDunkCentral @SpeakOnFS1 Wait so you really believe the Bucks would trade their best player in his prime for LeBron James 40 yr old https://t.co/OC68Hqse5A", "cleaned_tweet": "wait really believe bucks would trade best player prime lebron james yr old"}
{"username": 1737571425584615424, "original_tweet": "@vetalumnipod @HoopMixOnly To be clear I have no problems with you putting Jordan as the goat, but saying the nba was harder in the 90’s is hilarious, the skill is at an all time high", "cleaned_tweet": "clear problems putting jordan goat saying nba harder hilarious skill time high"}
{"username": 1506655872231133189, "original_tweet": "@Nolea23 @IssaShaikheldin @BronMuse Yes Lebron was by far the  best player that series. Locked Edwards up and was the best defender in playoffs. https://t.co/OLry5eE8WO", "cleaned_tweet": "yes lebron far best player series locked edwards best defender playoffs"}
{"username": 1737571425584615424, "original_tweet": "@vetalumnipod @HoopMixOnly That still doesn’t explain how the nba was harder to dominate in less talented nba, putting curry above lebron all time is egregious and disingenuous. All you’re doing is listing why Jordan is the goat lol not why the league was harder (it wasn’t)", "cleaned_tweet": "still doesnt explain nba harder dominate less talented nba putting curry lebron time egregious disingenuous youre listing jordan goat lol league harder wasnt"}
{"username": 1049052195927150594, "original_tweet": "@Snip3down Out in the 1st round just like your GOAT LeBron. 😂 https://t.co/mOkLyGnzSD", "cleaned_tweet": "st round like goat lebron"}
{"username": 250284395, "original_tweet": "@BarryOnHere Nobody cares what you think. Most modern NBA players as well as NBA fans say Jordan is the goat. https://t.co/QZmdga8idV", "cleaned_tweet": "nobody cares think modern nba players well nba fans say jordan goat"}
{"username": 1520935738686140416, "original_tweet": "@Ar15Mvp Your best player got carried by LeBron the only time he ever won anything significant stfu", "cleaned_tweet": "best player got carried lebron time ever anything significant stfu"}
{"username": 1079544224553594881, "original_tweet": "@jjcrtr @BricksCenter Lebron was the best player??? LMFAOOOO  forgot u had Luka on the team", "cleaned_tweet": "lebron best player lmfaoooo forgot luka team"}
{"username": 1173966508072062976, "original_tweet": "@Baby_slim214 @ReeseNewell @TodayInSportsCo Hey man, that’s your goat, I respect that. LeBron is an all time great", "cleaned_tweet": "hey man thats goat respect lebron time great"}
{"username": 1249506734571315200, "original_tweet": "@moon_walkin_ @BronGotGame LeBron is held to GOAT standards \n\nCurry is held to Top 10 standards \n\nSo what the fuck are you talking about everyone knows curry isn’t better than bron so why would they be held to the same standards???", "cleaned_tweet": "lebron held goat standards curry held top standards fuck talking everyone knows curry isnt better bron would held standards"}
{"username": 1756732768896110592, "original_tweet": "@BronMuse @AskPerplexity @grok I'm curious - how many game winning buzzer beater shots has LeBron James taken and missed? Is that stat out there? Who has best percentage?", "cleaned_tweet": "im curious many game winning buzzer beater shots lebron james taken missed stat best percentage"}
{"username": 1832832611086897153, "original_tweet": "@MaskedInLA Curry only made 4 first team all nbas which is less than Luka.  Plays zero defense and has zero all defense teams.  1 FMVP.  Needed Durant and 3 other all stars to beat LeBron with JR Smith as his second best player.   Most overrated player EVER.   His fans worst than Kobe fans", "cleaned_tweet": "curry made first team nbas less luka plays zero defense zero defense teams fmvp needed durant stars beat lebron jr smith second best player overrated player ever fans worst kobe fans"}
{"username": 1502077636763258881, "original_tweet": "@Hdifkejdkdjfj @BricksCenter He was the best player on his team vs the Wolves at 40 how is that “BTA”.  Once again why is Lebron being mentioned", "cleaned_tweet": "best player team vs wolves bta lebron mentioned"}
{"username": 2309122690, "original_tweet": "@LakersLead LeBron in the 4th vs the Wolves: 5.2 pts, 2.2 rebs, 1.8 asts.\n\nBro really put up Bronny numbers when it mattered most—talkin’ GOAT while statin’ like a rookie.", "cleaned_tweet": "lebron th vs wolves pts rebs asts bro really put bronny numbers mattered mosttalkin goat statin like rookie"}
{"username": 1235445985872162817, "original_tweet": "One day SAS, Skip, Barkley etc will be gone, and y’all can finally get that hate and bias out of your hearts and think with your own brains. Then yall would finally admit that Lebron James is the best and greatest basketball player to ever live. One day.", "cleaned_tweet": "one day sas skip barkley etc gone yall finally get hate bias hearts think brains yall would finally admit lebron james best greatest basketball player ever live one day"}
{"username": 597057433, "original_tweet": "@joelvmoran 2016 finals they lost draymond for a pivotal game (Lebron James stimulus package), Bogut got hurt, Iggy got hurt. Lost to who some sat is the GOAT, LeBron.\n\nLosing and being outplayed by Fred Van Vleet? Ain't no coming back from that one", "cleaned_tweet": "finals lost draymond pivotal game lebron james stimulus package bogut got hurt iggy got hurt lost sat goat lebron losing outplayed fred van vleet aint coming back one"}
{"username": 57504959, "original_tweet": "If your GOAT loses two different 3-1 leads in his career, we’re gonna have some serious conversations. Niggas were already tryna put him in Jordan-LeBron convos with championship fantasies this season 😂😂😂😂", "cleaned_tweet": "goat loses two different leads career gon na serious conversations niggas already tryna put jordanlebron convos championship fantasies season"}
{"username": 1917714336363208707, "original_tweet": "@Simon_555_ @BHutSFanatic @BayAreaTrev As a role player riding the coattails of Jordan Rodman and pippen…. And as a coach riding the coattails of the greatest pg ever and then adding the most talented scorer ever to create the best roster the nba has ever seen for 3 years 😭", "cleaned_tweet": "role player riding coattails jordan rodman pippen coach riding coattails greatest pg ever adding talented scorer ever create best roster nba ever seen years"}
{"username": 1264700647456124928, "original_tweet": "@TheHateCentral my goat doing a LeBron cosplay in the 4th 💔💔💔", "cleaned_tweet": "goat lebron cosplay th"}
{"username": 76174869, "original_tweet": "@td_nash Koby and LeBron. But magic is the best of the four", "cleaned_tweet": "koby lebron magic best four"}
{"username": 1352696152576176131, "original_tweet": "@HoopMixOnly LeBron isn’t the goat cope more", "cleaned_tweet": "lebron isnt goat cope"}
{"username": 48773, "original_tweet": "@HoopMixOnly Shaq said it best… no one will ever say “be like LeBron!”", "cleaned_tweet": "shaq said best one ever say like lebron"}
{"username": 1817751218585800704, "original_tweet": "@monk_4k @LeBron__legacy Your goat has blown ANOTHER 3-1 lead mf can’t close a series for shit", "cleaned_tweet": "goat blown another lead mf cant close series shit"}
{"username": 1771556200242728961, "original_tweet": "@_1_Skyler_1_ @MrOldMan9000 @NBAMemes Lebron won down 3-1 without a top 75 teammate Vs a 73-9 team, unanimous MVP and had the best game 7 finals performance ever. Smoke that bih https://t.co/VkvPdWnd4K", "cleaned_tweet": "lebron without top teammate vs team unanimous mvp best game finals performance ever smoke bih"}
{"username": 1813618923725885440, "original_tweet": "@toney349092 @ApexJones22 Bruh stop spam replying 1 at a time please.\n\nLeBron won with completely different team and different skill sets.\n\nJordan completely failed and played like crap whenever he didn’t have his system.\n\nGoat vs system role scorer", "cleaned_tweet": "bruh stop spam replying time please lebron completely different team different skill sets jordan completely failed played like crap whenever didnt system goat vs system role scorer"}
{"username": 1021668088377274368, "original_tweet": "@warriors @grok how do steph always choking a 3-1 lead \nhow can it affect curry legacy.\nalso explain why lebron is the goat of the basketball", "cleaned_tweet": "steph always choking lead affect curry legacy also explain lebron goat basketball"}
{"username": 1249506734571315200, "original_tweet": "@moon_walkin_ @BronGotGame Doing “tricks” is wild all I said was he a top 10 player regardless. Same way that LeBron is still the GOAT. I keep the same standards in a positive way to uplift both players because I can appreciate greatness you fucking idiot", "cleaned_tweet": "tricks wild said top player regardless way lebron still goat keep standards positive way uplift players appreciate greatness fucking idiot"}
{"username": 3433749249, "original_tweet": "@oldskoolbballx 😐 and people still saying LeBron is the goat 🙄", "cleaned_tweet": "people still saying lebron goat"}
{"username": 1606104287376982018, "original_tweet": "@HoodiZeebo To lower his usage rate on post defense, crashing boards, scoring down low etc. LeBron at his best is LeBron with energy and taking that step back and making space for talent is better for him and the team", "cleaned_tweet": "lower usage rate post defense crashing boards scoring low etc lebron best lebron energy taking step back making space talent better team"}
{"username": 1249506734571315200, "original_tweet": "@jaxson200525 @Ar15Mvp @HoodiGarland They only compare because of the accolades that Jordan has. 75% of people you see talking about basketball have never seen Jordan play in real time outside of highlights. That’s why this GOAT debate shit is just goofy to me", "cleaned_tweet": "compare accolades jordan people see talking basketball never seen jordan play real time outside highlights thats goat debate shit goofy"}
{"username": 1773742814804819968, "original_tweet": "These guys make fun of LeBron fans for having a scapegoat at all times but look how fast they turn on the same guy who was the \"DPOY\" and \"best defender of our generation\" to them a few days ago https://t.co/Feme3QCuZj", "cleaned_tweet": "guys make fun lebron fans scapegoat times look fast turn guy dpoy best defender generation days ago"}
{"username": 1220887063689682944, "original_tweet": "@stephenasmith So IF STEPH CURRY LOSE AND LET THE ROCKETS MAKE HISTORY AND COME BAK FROM A 3-1 lead does this hurt his legacy or THAT DOUBLE STANDARD SHIT ONLY APPLIES TO GOAT LEBRON JAMES", "cleaned_tweet": "steph curry lose let rockets make history come bak lead hurt legacy double standard shit applies goat lebron james"}
{"username": 428498287, "original_tweet": "@uconnfan12 It’s LeBron James. It’s the best modern player in the history of the sport. The Rockets are not great offensively. Far from it. And they don’t possess a superstar. Cleveland had multiple — GSW still has MULTIPLE on this team.", "cleaned_tweet": "lebron james best modern player history sport rockets great offensively far dont possess superstar cleveland multiple gsw still multiple team"}
{"username": 1349776434630258690, "original_tweet": "@LakeShowYo He’s not Lebron - his weirdo fan base don’t hold him to the same standard as the GOAT - that’s what makes this shit so stupid", "cleaned_tweet": "hes lebron weirdo fan base dont hold standard goat thats makes shit stupid"}
